[
    {
        "id": "tt0078732",
        "movie_name": "Action",
        "release_year": "1980",
        "director": "Tinto Brass",
        "summary": "Bruno is an idealistic hero who questions the meaning of life in this confusing and sometimes hallucinatory erotic drama. After a night in jail, he is gang-raped by punk rockers in a garbage dump. He later saves an old man who believes he is Garibaldi and a woman he believes is O...Read all",
        "rating": "4.4"
    },
    {
        "id": "tt0094612",
        "movie_name": "Action Jericho",
        "release_year": "1988",
        "director": "Craig R. Baxley",
        "summary": "Vengeance drives a tough Detroit cop to stay on the trail of a power-hungry auto magnate who is systematically eliminating his competition.",
        "rating": "5.6"
    },
    {
        "id": "tt21191806",
        "movie_name": "Back in Action",
        "release_year": "2025",
        "director": "Seth Gordon",
        "summary": "Former CIA spies Emily and Matt are pulled back into espionage after their secret identities are exposed.",
        "rating": "5.9"
    },
    {
        "id": "tt0107362",
        "movie_name": "Last Action Hero",
        "release_year": "1993",
        "director": "John McTiernan",
        "summary": "With the help of a magic ticket, a young movie fan is transported into the fictional world of his favorite action movie character.",
        "rating": "6.5"
    },
    {
        "id": "tt6495770",
        "movie_name": "Action Point",
        "release_year": "2018",
        "director": "Tim Kirkby",
        "summary": "A daredevil designs and operates his own theme park with his friends.",
        "rating": "5.1"
    },
    {
        "id": "tt15263752",
        "movie_name": "Action! Action!",
        "release_year": "2025",
        "director": "Adam Kilbourn, Danny Shepherd",
        "summary": "A crew attempts to steal Al Capone's painting from Vegas' Mob Museum. After a double-cross leaves teammates dead and the painting destroyed, they race to uncover who betrayed them.",
        "rating": "9.4"
    },
    {
        "id": "tt1396208",
        "movie_name": "Action Replayy",
        "release_year": "2010",
        "director": "Vipul Amrutlal Shah",
        "summary": "A young man tries to revive his parents' wilting marriage by traveling to the 1970s when their romance was budding and make it bloom: something more complex than he expects.",
        "rating": "4.4"
    },
    {
        "id": "tt10955578",
        "movie_name": "Action",
        "release_year": "2019",
        "director": "Sundar C.",
        "summary": "An agent, sent by the Indian army to observe a terrorist, finds his mission complicated when he discovers undercover agents in his own country.",
        "rating": "4.7"
    },
    {
        "id": "tt0087727",
        "movie_name": "Missing in Action",
        "release_year": "1984",
        "director": "Joseph Zito",
        "summary": "Colonel Braddock launches a mission deep into the jungles of Vietnam to find the POW camp that he escaped from and free the Americans still held captive there.",
        "rating": "5.4"
    },
    {
        "id": "tt0120633",
        "movie_name": "A Civil Action",
        "release_year": "1998",
        "director": "Steven Zaillian",
        "summary": "At the risk of bankrupting his firm and career, lawyer Jan Schlichtman takes on a case involving two companies responsible for causing children to be diagnosed with leukemia due to the town's contaminated water supply.",
        "rating": "6.6"
    },
    {
        "id": "tt0318155",
        "movie_name": "Looney Tunes: Back in Action",
        "release_year": "2003",
        "director": "Joe Dante",
        "summary": "Bugs Bunny and Daffy Duck team up with an aspiring stuntman and a studio executive in order to rescue the stuntman's missing father and locate a mythical diamond before the head of a major conglomerate uses it for his own wicked deeds.",
        "rating": "5.8"
    },
    {
        "id": "tt15600222",
        "movie_name": "An Action Hero",
        "release_year": "2022",
        "director": "Anirudh Iyer",
        "summary": "A murder accusation turns a movie star's own life into an eccentric action thriller as he flees the country, with a vengeful politician hot on his heels.",
        "rating": "7.0"
    },
    {
        "id": "tt11015214",
        "movie_name": "Class Action Park",
        "release_year": "2020",
        "director": "Seth Porges, Chris Charles Scott III",
        "summary": "A documentary that focuses on a dangerously legendary water park and its slew of injuries and crimes along with child safety concerns.",
        "rating": "7.0"
    },
    {
        "id": "tt0035608",
        "movie_name": "Action in the North Atlantic",
        "release_year": "1943",
        "director": "Lloyd Bacon, Byron Haskin, Raoul Walsh",
        "summary": "An American tanker is sunk by a German U-boat, and the survivors spend 11 days at sea on a raft. Their next assignment - bound for Murmansk through the sub-stalked N. Atlantic.",
        "rating": "7.0"
    },
    {
        "id": "tt15237908",
        "movie_name": "Action Force",
        "release_year": "Joe Anoa'i, Pierson Fode",
        "director": "N/A",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt0101590",
        "movie_name": "Class Action",
        "release_year": "1991",
        "director": "Michael Apted",
        "summary": "An attorney representing a traumatized accident victim finds that his opponent is a very familiar defense attorney - his own daughter.",
        "rating": "6.4"
    },
    {
        "id": "tt12703292",
        "movie_name": "A Man of Action",
        "release_year": "2022",
        "director": "Javier Ruiz Caldera",
        "summary": "In this drama inspired by the life of Lucio Urtubia, an anarchist targets one of the world's biggest banks with an ingenious counterfeiting operations.",
        "rating": "6.4"
    },
    {
        "id": "tt0403935",
        "movie_name": "Action Jackson",
        "release_year": "2014",
        "director": "Prabhu Deva",
        "summary": "In order to escape crime and clutches of a ruthless mafia, a Bangkok based hit man seeks the help of his lookalike, a Mumbai based goon.",
        "rating": "3.4"
    },
    {
        "id": "tt5320514",
        "movie_name": "Action Hero Biju",
        "release_year": "2016",
        "director": "Abrid Shine",
        "summary": "The life of an honest and determined police officer Biju and the various criminals he puts behind bars.",
        "rating": "7.6"
    },
    {
        "id": "tt0106215",
        "movie_name": "Acción mutante",
        "release_year": "1993",
        "director": "Álex de la Iglesia",
        "summary": "In a future ruled by attractive people, mutant terrorists kidnap a rich man's daughter to claim rights for the ugly. Escaping police, the mutant leader crashes into a planet of crazy miners where no women live.",
        "rating": "6.4"
    },
    {
        "id": "tt0089604",
        "movie_name": "Missing in Action 2: The Beginning",
        "release_year": "1985",
        "director": "Lance Hool",
        "summary": "Prequel to the first Missing In Action, set in the early 1980s it shows the capture of Colonel Braddock during the Vietnam war in the 1970s, and his captivity with other American POWs in a brutal prison camp, and his plans to escape.",
        "rating": "5.3"
    },
    {
        "id": "tt8678318",
        "movie_name": "Gundam I: The Live-Action Movie",
        "release_year": "Leon Masuda, Alexander Raye Pimentel",
        "director": "Jim Mickle, Jordan Vogt-Roberts",
        "summary": "After an attack on his space colony high above the planet Earth, Amuro Ray climbs in his father's prototype mobile suit, a Gundam--to protect the populace from Zeon invaders. Strict adaptation of the animated movie \"Mobile Suit Gundam I.\"",
        "rating": "N/A"
    },
    {
        "id": "tt0096757",
        "movie_name": "Action U.S.A.",
        "release_year": "1989",
        "director": "John Stewart",
        "summary": "After her boyfriend is murdered by the gangsters whose diamonds he stole, a girl is protected by two FBI agents who plan to keep her from sharing the same fate.",
        "rating": "6.0"
    },
    {
        "id": "tt0070046",
        "movie_name": "Executive Action",
        "release_year": "1973",
        "director": "David Miller",
        "summary": "Rogue intelligence agents, right-wing politicians, greedy capitalists, and free-lance assassins plot and carry out the JFK assassination.",
        "rating": "6.7"
    },
    {
        "id": "tt13186482",
        "movie_name": "Mufasa: The Lion King",
        "release_year": "2024",
        "director": "Barry Jenkins",
        "summary": "Mufasa, a cub lost and alone, meets a sympathetic lion named Taka, the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of a group of misfits searching for their destiny.",
        "rating": "6.6"
    },
    {
        "id": "tt0109195",
        "movie_name": "Back in Action",
        "release_year": "1994",
        "director": "Steve DiMarco, Paul Ziller",
        "summary": "Former U.S. Green Beret's sister dates a mobster, endangering her life. Her brother fights to save her from her boyfriend and his friends, with or without help from tough cop Rossi.",
        "rating": "5.4"
    },
    {
        "id": "tt0076543",
        "movie_name": "A Piece of the Action",
        "release_year": "1977",
        "director": "Sidney Poitier",
        "summary": "A retired Chicago cop blackmails two rich thieves into \"volunteering\" to help juvenile delinquents change paths.",
        "rating": "6.4"
    },
    {
        "id": "tt5195538",
        "movie_name": "Untitled Hong Kong Action Thriller",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt2298239",
        "movie_name": "Action #1",
        "release_year": "Mike Castle, Jimmy Tatro",
        "director": "Alex Fernie",
        "summary": "A comic book store-owner assembles five smart and equally geeky associates to pull off the heist of a lifetime- stealing the most valuable comic from Nicholas Cage and holding it for ransom.",
        "rating": "N/A"
    },
    {
        "id": "tt7656570",
        "movie_name": "Legal Action",
        "release_year": "2018",
        "director": "Brent Christy",
        "summary": "A woman asks her big shot lawyer ex-husband to defend her career criminal brother, accused of killing a DA. He'll need more than his legal skills to stay alive and win the case.",
        "rating": "5.9"
    },
    {
        "id": "tt0094792",
        "movie_name": "Braddock: Missing in Action III",
        "release_year": "1988",
        "director": "Aaron Norris",
        "summary": "Braddock mounts a one-man assault to free his wife and son who are still being held in a Vietnam prison camp.",
        "rating": "4.9"
    },
    {
        "id": "tt0357413",
        "movie_name": "Anchorman: The Legend of Ron Burgundy",
        "release_year": "2004",
        "director": "Adam McKay",
        "summary": "In the 1970s, an anchorman's stint as San Diego's top-rated newsreader is challenged when an ambitious newswoman becomes his co-anchor.",
        "rating": "7.1"
    },
    {
        "id": "tt0075083",
        "movie_name": "La polizia accusa: il servizio segreto uccide",
        "release_year": "1975",
        "director": "Sergio Martino",
        "summary": "Starting the investigation of a murder mystery, a police man is to investigate dangerously top politicians and military. A chain of suicides takes its toll among the current and past leaders of Italy in a particularly difficult season for the Italian Democracy.",
        "rating": "6.4"
    },
    {
        "id": "tt0050099",
        "movie_name": "Action of the Tiger",
        "release_year": "1957",
        "director": "Terence Young",
        "summary": "Carson is an American contraband runner approached by Tracy, a French woman who wants him to help rescue her brother from Albania where he is being held as a political prisoner.",
        "rating": "5.1"
    },
    {
        "id": "tt31598972",
        "movie_name": "Maa Kaali",
        "release_year": "2024",
        "director": "Vijay Yelakanti",
        "summary": "The tragic events of August 16, 1946 - one of the darkest chapters in the history of Bengal. The communal violence that erupted on that day that deeply affected the lives of countless people of the region.",
        "rating": "N/A"
    },
    {
        "id": "tt5805470",
        "movie_name": "Gintama",
        "release_year": "2017",
        "director": "Yûichi Fukuda",
        "summary": "In an era where aliens have invaded and conquered feudal Tokyo, a young samurai seeks work as he can.",
        "rating": "6.1"
    },
    {
        "id": "tt0368688",
        "movie_name": "Direct Action",
        "release_year": "2004",
        "director": "Sidney J. Furie",
        "summary": "Frank Gannon, a veteran cop, is being hunted by his fellow police officers after they learned he has betrayed the brotherhood and exposed to the feds wide scale corruption of the LAPD. He has one day left to prove his case and survive.",
        "rating": "5.0"
    },
    {
        "id": "tt1448754",
        "movie_name": "Thanksgiving",
        "release_year": "2023",
        "director": "Eli Roth",
        "summary": "After a Black Friday riot ends in tragedy, a mysterious Thanksgiving-inspired killer terrorizes Plymouth, Massachusetts, the birthplace of the infamous holiday.",
        "rating": "6.2"
    },
    {
        "id": "tt2370244",
        "movie_name": "Action",
        "release_year": "2013",
        "director": "Anil Sunkara",
        "summary": "Bava (Allari Naresh), Ajay (Kick Shyam), Shiva (Vaibhav) and Purush (Raju Sundaram) are thick friends. They grow up together and share everything in life. While Bava is an easy going person, Ajay and Shiva are seen as more mature and responsible people. Purush is a comical flirt....Read all",
        "rating": "3.4"
    },
    {
        "id": "tt17677492",
        "movie_name": "The Violence Action",
        "release_year": "2022",
        "director": "Tôichirô Rutô",
        "summary": "A young girl leads a double life as an assassin for hire.",
        "rating": "4.8"
    },
    {
        "id": "tt6772950",
        "movie_name": "Truth or Dare",
        "release_year": "2018",
        "director": "Jeff Wadlow",
        "summary": "A harmless game of Truth or Dare among friends turns deadly when someone - or something - begins to punish those who tell a lie or refuse the dare.",
        "rating": "5.2"
    },
    {
        "id": "tt0061000",
        "movie_name": "Le Soleil Des Voyous",
        "release_year": "1967",
        "director": "Jean Delannoy",
        "summary": "Sophisticated crook talks ex-crook and now respectable business man into one last caper. This highly planned and well executed crime goes off without a hitch until rival bad guys want a piece of the action.",
        "rating": "6.4"
    },
    {
        "id": "tt0176948",
        "movie_name": "Love and Action in Chicago",
        "release_year": "1999",
        "director": "Dwayne Johnson-Cochran",
        "summary": "Eddie Jones (Courtney B. Vance) is an agent with the U.S. State Department's elite Eliminator Corps. He eliminates people the government doesn't want around. Eddie also needs to change his life.",
        "rating": "4.9"
    },
    {
        "id": "tt34621929",
        "movie_name": "Untitled Zach Snyder LAPD Action Movie",
        "release_year": NaN,
        "director": "Zack Snyder",
        "summary": "An elite LAPD unit confronts the clash between law and morality in high-stakes life-and-death situations, exploring the intense and complex landscape of law enforcement.",
        "rating": "N/A"
    },
    {
        "id": "tt0167145",
        "movie_name": "Evasive Action",
        "release_year": "1998",
        "director": "Jerry P. Jacobs",
        "summary": "Five prisoners on train to prison. Brakes fail, train speeds to LA. One prisoner uncouples cars to save passengers, others hunt him to stop escape.",
        "rating": "4.6"
    },
    {
        "id": "tt10323676",
        "movie_name": "The Contractor",
        "release_year": "2022",
        "director": "Tarik Saleh",
        "summary": "A discharged U.S. Army Special Operations Forces sergeant, James Harper, risks everything for his family when he joins a private contracting organization.",
        "rating": "5.8"
    },
    {
        "id": "tt13423846",
        "movie_name": "321 Action",
        "release_year": "2020",
        "director": "Shady Al Ramly",
        "summary": "A solitary actress devoted to caring for her daughter decides to return to acting with a new movie; many comedic ironies occur during the filming of this new film.",
        "rating": "1.0"
    },
    {
        "id": "tt0337887",
        "movie_name": "Sledge: The Untold Story",
        "release_year": "2005",
        "director": "Brad Martin",
        "summary": "In the spring of 1986, no one had heard of Frank Sledge. One year later, Bloodfight 2 was #1 at the box office... And a star was born.",
        "rating": "3.8"
    },
    {
        "id": "tt26673530",
        "movie_name": "The Action Pack",
        "release_year": "2023",
        "director": "Vali Dobrogeanu",
        "summary": "A traffic officer who likes playing detective starts investigating a case, uncovering dangers beyond what he thought was a simple bookie robbery.",
        "rating": "4.9"
    },
    {
        "id": "tt7117870",
        "movie_name": "Love Action Drama",
        "release_year": "2019",
        "director": "Dhyan Sreenivasan",
        "summary": "A man goes through all kinds of action to impress the girl he is in love with a hope to marry her.",
        "rating": "5.2"
    },
    {
        "id": "tt28751601",
        "movie_name": "Action!",
        "release_year": "2023",
        "director": "Eric Palmer",
        "summary": "Mia sets out to Film her own movie. Justin documents the making of the film. Things go off script. Shea begins killing the cast in order to make his own film.",
        "rating": "N/A"
    },
    {
        "id": "tt0036579",
        "movie_name": "Action in Arabia",
        "release_year": "1944",
        "director": "Léonide Moguy",
        "summary": "Reporter Michael Gordon uncovers intrigue in Damascus, where the Allies and Nazis struggle for control of Arab sympathies.",
        "rating": "6.2"
    },
    {
        "id": "tt8840400",
        "movie_name": "In Search of the Last Action Heroes",
        "release_year": "2019",
        "director": "Oliver Harper",
        "summary": "A comprehensive retrospective of the 80's and 90's action film genre.",
        "rating": "7.2"
    },
    {
        "id": "tt0409848",
        "movie_name": "Kureyon Shinchan: Action Kamen vs Haigure Maô",
        "release_year": "1993",
        "director": "Mitsuru Hongô",
        "summary": "Action Kamen comes to Shinchan's world seeking help from Shinchan to defeat the Haigure Demon. Then the adventure of Shinchan and his family begins.",
        "rating": "6.7"
    },
    {
        "id": "tt27487348",
        "movie_name": "Action Hero Biju 2",
        "release_year": "Joju George, Nivin Pauly",
        "director": "Abrid Shine, Soubir Ghosh",
        "summary": "The focus centers on the day-to-day activities of SI Biju Poulose and his colleagues as they tackle routine and serious crimes at their local police station.",
        "rating": "N/A"
    },
    {
        "id": "tt10782784",
        "movie_name": "Toy Story 2: Live Action",
        "release_year": "2025",
        "director": "Shahzaib Yaqoob",
        "summary": "A full featured live-action remake of Toy Story 2",
        "rating": "N/A"
    },
    {
        "id": "tt28305739",
        "movie_name": "Action 8",
        "release_year": "Yolanthe Cabau, Amara Wayans",
        "director": "Maximillian Decker",
        "summary": "News is changing and being reformatted to reach more viewers. Larry Daniels is a real journalist on a podcast now facing all kinds of distractions with reality shows and bringing in infotainment to bring more viewers.",
        "rating": "N/A"
    },
    {
        "id": "tt33319882",
        "movie_name": "Untitled action film",
        "release_year": "Kamal Haasan, Salman Khan",
        "director": "Atlee",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt0053142",
        "movie_name": "Operation Dames",
        "release_year": "1959",
        "director": "Louis Clyde Stoumen",
        "summary": "During the Korean War, a troupe of traveling USO entertainers find themselves behind enemy lines with a squad of American soldiers. Together they try to find their way back to their own lines while trying to avoid capture, but the North Koreans discover their presence and set out...Read all",
        "rating": "4.0"
    },
    {
        "id": "tt0069677",
        "movie_name": "Action: The October Crisis of 1970",
        "release_year": "1974",
        "director": "Robin Spry",
        "summary": "A historical account of the French-Canadian terrorist kidnapping incident and the Federal Govt.'s response by declaring martial-law.",
        "rating": "7.6"
    },
    {
        "id": "tt0048925",
        "movie_name": "Action immédiate",
        "release_year": "1957",
        "director": "Maurice Labro",
        "summary": "The secret blueprints are stolen from national security. French secret service agent Walder believes that the documents are now in Switzerland, in the hands of a man named Lindbaum.",
        "rating": "5.6"
    },
    {
        "id": "tt0036386",
        "movie_name": "Stand by for Action",
        "release_year": "1942",
        "director": "Robert Z. Leonard",
        "summary": "During WW2, two Navy officers take command of an obsolete, World War I-vintage, destroyer that is assigned to convoy-escort duty in the Japanese-controlled waters of the South Pacific.",
        "rating": "6.5"
    },
    {
        "id": "tt20417836",
        "movie_name": "Action team overlord flower",
        "release_year": "2022",
        "director": "Liu Bayin",
        "summary": "A few months ago, Zhou Mo, an officer of GWS corporation in a foreign city disappeared. Chen You, Meiya and others went to a place to rescue Zhou Mo.",
        "rating": "5.9"
    },
    {
        "id": "tt6526078",
        "movie_name": "Untitled Filip Markovic Action Movie",
        "release_year": "Kartik Aaryan, Fardeen Khan",
        "director": "Kunal Kohli",
        "summary": "Set in the YRF Spy Universe",
        "rating": "N/A"
    },
    {
        "id": "tt7917688",
        "movie_name": "Dykes, Camera, Action!",
        "release_year": "2018",
        "director": "Caroline Berler",
        "summary": "A history of queer cinema from the women who made it happen.",
        "rating": "7.7"
    },
    {
        "id": "tt0056691",
        "movie_name": "Who's Got the Action?",
        "release_year": "1962",
        "director": "Daniel Mann",
        "summary": "Horse-player Steve Flood's marriage is threatened by his betting; in desperation, his wife Melanie becomes his bookie and enlists his lecherous law partner Clint Morgan to help. Steve's hot streak causes unforeseen complications.",
        "rating": "5.5"
    },
    {
        "id": "tt14377236",
        "movie_name": "The Great American Action Hero",
        "release_year": "Lee Majors, Jake Busey",
        "director": "Shawn Welling",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt35115983",
        "movie_name": "2025 Oscar Nominated Short Films: Live Action",
        "release_year": "2025",
        "director": "N/A",
        "summary": "2025 Oscar Nominated Short Films (Live Action): \"The Man Who Could Not Remain Silent\" - 20 min, Croatia (Croatian) \"Anuja\" - 18 min, India (Hindi) \"I'm Not a Robot\" - 15 min, Belgium/Netherlands (Dutch) \"A Lien\" - 22 min, USA (English) \"The Last Ranger\" - 23 min, South Africa (Af...Read all",
        "rating": "7.8"
    },
    {
        "id": "tt0071884",
        "movie_name": "Mädchen, die sich hocharbeiten",
        "release_year": "1974",
        "director": "Erwin C. Dietrich",
        "summary": "",
        "rating": "4.1"
    },
    {
        "id": "tt35673289",
        "movie_name": "Bakugan Live Action",
        "release_year": NaN,
        "director": "Brad Peyton",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt0266224",
        "movie_name": "Action Is Not Missing",
        "release_year": "1987",
        "director": "Angel Labra",
        "summary": "The members of the group are sent to Vietnam. The war between North and South is still in full swing.",
        "rating": "4.8"
    },
    {
        "id": "tt9081188",
        "movie_name": "Fireman Sam: Set for Action!",
        "release_year": "2018",
        "director": "Gary Andrews, Clint Butler",
        "summary": "The alarm has sounded and the Pontypandy crew is off to rescue their friends and others in need. From engine sparks and wild fireworks to water rescue and more, you won't want to miss these adventures with your favorite hero, Fireman Sam!",
        "rating": "4.7"
    },
    {
        "id": "tt5260532",
        "movie_name": "Untitled Dwayne Johnson Action Comedy",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt0029838",
        "movie_name": "Action for Slander",
        "release_year": "1937",
        "director": "Tim Whelan, Victor Saville",
        "summary": "A bankrupt officer, accused of cheating at cards, defends his honour with a writ.",
        "rating": "6.6"
    },
    {
        "id": "tt31015444",
        "movie_name": "Direct Action",
        "release_year": "2024",
        "director": "Guillaume Cailleau, Ben Russell",
        "summary": "Centers on the daily routines of activists, squatters, anarchists, farmers, and people the government deems \"eco-terrorists.\"",
        "rating": "5.5"
    },
    {
        "id": "tt0378389",
        "movie_name": "Movie in Action",
        "release_year": "1987",
        "director": "Teddy Page",
        "summary": "A movie crew is shooting in Thailand when some military guys kidnap the female star. The crew decide to fight back to get the movie star while shooting their movie.",
        "rating": "6.5"
    },
    {
        "id": "tt1838722",
        "movie_name": "Truth or Dare",
        "release_year": "2012",
        "director": "Robert Heath",
        "summary": "Young British boys and girls travel to an isolated cabin after being promised a night of heavy partying. Instead of the fun they hoped for, they meet a killer out to reap vengeance on them for the death of his brother.",
        "rating": "5.6"
    },
    {
        "id": "tt0109813",
        "movie_name": "The Flintstones",
        "release_year": "1994",
        "director": "Brian Levant",
        "summary": "In a parallel modern-day Stone Age world, a working-class family, the Flintstones, are set up for an executive job. But they learn that money can't buy happiness.",
        "rating": "5.0"
    },
    {
        "id": "tt12982582",
        "movie_name": "Spooky Action",
        "release_year": "2023",
        "director": "Rod Bingaman",
        "summary": "Time travelers kidnap a 1990s NASA scientist and loop him into the future in order to steal his anti-aging research. Meanwhile his wife suffers a sexual identity crisis and becomes the prime suspect in his disappearance.",
        "rating": "5.8"
    },
    {
        "id": "tt0103719",
        "movie_name": "Armed for Action",
        "release_year": "1992",
        "director": "Bret McCormick",
        "summary": "A cop transporting a Mafia hitman across country is ambushed in a small town.",
        "rating": "4.2"
    },
    {
        "id": "tt3158386",
        "movie_name": "'Untitled Female Led Action/Thriller'",
        "release_year": "Graham McTavish, Peter Mensah",
        "director": "Ileana D. Vasquez",
        "summary": "Plot under wraps",
        "rating": "N/A"
    },
    {
        "id": "tt0175593",
        "movie_name": "Enemy Action",
        "release_year": "1999",
        "director": "Brian Katkin",
        "summary": "Two Air Force officers are after a stolen high teck smart bomb.",
        "rating": "3.9"
    },
    {
        "id": "tt1441233",
        "movie_name": "Woo-ri aek-syeon-bae-woo-da",
        "release_year": "2008",
        "director": "Jung Byung-gil",
        "summary": "A documentary on five young wannabe stuntmen working in the South Korean film industry.",
        "rating": "6.6"
    },
    {
        "id": "tt0179901",
        "movie_name": "Cop",
        "release_year": "1976",
        "director": "Marino Girolami",
        "summary": "A crime syndicate starts a crime wave in Turin, they rob a bank, taking a hostage to get away from Police Inspector Betti and Ferrari, his partner. However, the hostage turned out to be their accomplice in disguise.",
        "rating": "6.6"
    },
    {
        "id": "tt35926717",
        "movie_name": "Untitled Live-Action Barney movie Project",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt0011906",
        "movie_name": "Action",
        "release_year": "1921",
        "director": "John Ford",
        "summary": "Orphaned Molly is heir to a ranch and mine and falls under the influence of saloon-owner Plimsoll, who schemes to deprive her of the inheritance. Sandy Brouke and his pals, Soda Water Manning and Mormon Peters, wander off the range and champion the girl's interests. Sandy falls i...Read all",
        "rating": "4.9"
    },
    {
        "id": "tt24133834",
        "movie_name": "Rapid Action",
        "release_year": "2023",
        "director": "Leo Wang",
        "summary": "Blaming himself for the death of his wife, Gao Feng left the security industry and lived an ordinary life with his son. Six years later, due to the arrival of his former boss, Gao Feng has no choice but to return, to the old profession.",
        "rating": "4.8"
    },
    {
        "id": "tt0180406",
        "movie_name": "Akcija",
        "release_year": "1960",
        "director": "Jane Kavcic",
        "summary": "Psychological action drama about a group of partisans, ambushed by the enemy.",
        "rating": "5.8"
    },
    {
        "id": "tt0176145",
        "movie_name": "Single Action",
        "release_year": "1998",
        "director": "Carlos Gallardo",
        "summary": "The killing of a political leader shatters the peace of a small Mexican town. MANCO, the brother of the murdered presidential candidate knows the killer and sets out to exact his revenge. Arriving to investigate the assassination is special agent AMIGO from the Mexican Intelligen...Read all",
        "rating": "4.3"
    },
    {
        "id": "tt5363994",
        "movie_name": "Action Movie Kid",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt28331320",
        "movie_name": "Cruella: Live Action Novelization",
        "release_year": "2021",
        "director": "Elizabeth Knowelden",
        "summary": "",
        "rating": "9.0"
    },
    {
        "id": "tt7022500",
        "movie_name": "Tam jeong 2",
        "release_year": "2018",
        "director": "Lee Eon-hie",
        "summary": "A homicide detective and his partner recruit the help of an online private eye to solve a murder case.",
        "rating": "6.5"
    },
    {
        "id": "tt0116253",
        "movie_name": "Executive Decision",
        "release_year": "1996",
        "director": "Stuart Baird",
        "summary": "When terrorists seize control of an airliner, an intelligence analyst accompanies a commando unit for a midair boarding operation.",
        "rating": "6.5"
    },
    {
        "id": "tt6092354",
        "movie_name": "And Action",
        "release_year": "2017",
        "director": "David Oryan",
        "summary": "A young Lebanese girl with a complicated past gets an opportunity to turn her life around by making her debut film. When her past catches up with her, she must struggle to be someone she's not and keep her story a secret.",
        "rating": "5.8"
    },
    {
        "id": "tt0077376",
        "movie_name": "Covert Action",
        "release_year": "1978",
        "director": "Romolo Guerrieri",
        "summary": "CIA agent's life is endangered after he writes a book about his career with the agency.",
        "rating": "5.3"
    },
    {
        "id": "tt6098564",
        "movie_name": "20 Minutes of Action",
        "release_year": "2020",
        "director": "Charles Nuckolls",
        "summary": "20 Minutes Of Action brings to life in performance the harrowing victim's impact statement written by the Brock Turner rape survivor known as Emily Doe.",
        "rating": "N/A"
    },
    {
        "id": "tt37021583",
        "movie_name": "Spooky Action at a Distance",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt0395972",
        "movie_name": "North Country",
        "release_year": "2005",
        "director": "Niki Caro",
        "summary": "A fictionalized account of the first major successful sexual harassment case in the United States, Jenson vs. Eveleth Mines, where a woman who endured a range of abuse while working as a miner filed and won the landmark 1984 lawsuit.",
        "rating": "7.3"
    },
    {
        "id": "tt12327512",
        "movie_name": "In Action",
        "release_year": "2020",
        "director": "Sean Kenealy, Eric Silvera",
        "summary": "Sean and Eric are just two bumbling screenwriters drafting the \"next big action flick\", utterly oblivious to the insanity that awaits when the government intercepts their script, believing it to be a veritable terrorist plot.",
        "rating": "5.7"
    },
    {
        "id": "tt0085794",
        "movie_name": "The King of Comedy",
        "release_year": "1982",
        "director": "Martin Scorsese",
        "summary": "Rupert is an aspiring stand-up comedian, who is willing to go the extra mile in his attempt to appear in the late night show hosted by his idol.",
        "rating": "7.8"
    },
    {
        "id": "tt0304678",
        "movie_name": "Sex Is Comedy",
        "release_year": "2002",
        "director": "Catherine Breillat",
        "summary": "A director struggles to film a difficult, intimate sex scene between two actors who happen to hate each other.",
        "rating": "5.7"
    },
    {
        "id": "tt30850798",
        "movie_name": "RAM: Rapid Action Mission",
        "release_year": "2024",
        "director": "Mihiraam Vynateyaa",
        "summary": "A young rebel who hates the Defense Forces because he lost his father to the war.",
        "rating": "5.2"
    },
    {
        "id": "tt1754811",
        "movie_name": "InAPPropriate Comedy",
        "release_year": "2013",
        "director": "Vince Offer",
        "summary": "In this comedy film, a computer tablet full of the world's most hilariously offensive apps breaks through the borders of political correctness, stirring up cultural anarchy.",
        "rating": "2.7"
    },
    {
        "id": "tt0188766",
        "movie_name": "King of Comedy",
        "release_year": "1999",
        "director": "Stephen Chow, Lik-Chi Lee",
        "summary": "A bar girl hires a struggling actor to give her acting lessons so that she can feign a greater interest in her customers. The longer they work together, the more they find they have in common.",
        "rating": "7.2"
    },
    {
        "id": "tt0056943",
        "movie_name": "The Comedy of Terrors",
        "release_year": "1963",
        "director": "Jacques Tourneur",
        "summary": "Dishonest undertaker Waldo Trumbull and his sidekick Felix Gillie are creating their own customers when they cannot find willing ones.",
        "rating": "6.5"
    },
    {
        "id": "tt0222850",
        "movie_name": "The Broken Hearts Club: A Romantic Comedy",
        "release_year": "2000",
        "director": "Greg Berlanti",
        "summary": "An insight into the turbulent lives and loves of a gay clique based in Los Angeles.",
        "rating": "6.9"
    },
    {
        "id": "tt0084329",
        "movie_name": "A Midsummer Night's Sex Comedy",
        "release_year": "1982",
        "director": "Woody Allen",
        "summary": "In the early 20th century, wacky inventor Andrew Hobbs and his wife Adrian invite two other couples for a weekend party at their romantic summer house in the countryside in this paean to Ingmar Bergman's Smiles of a Summer Night.",
        "rating": "6.6"
    },
    {
        "id": "tt0236388",
        "movie_name": "The Original Kings of Comedy",
        "release_year": "2000",
        "director": "Spike Lee",
        "summary": "A concert film featuring four major African American stand up comedians.",
        "rating": "6.8"
    },
    {
        "id": "tt2112293",
        "movie_name": "The Comedy",
        "release_year": "2012",
        "director": "Rick Alverson",
        "summary": "Indifferent to the notion of inheriting his father's estate, a restless, aging New Yorker passes time with his friends in games of mock sincerity and irreverence.",
        "rating": "6.3"
    },
    {
        "id": "tt0201290",
        "movie_name": "The Underground Comedy Movie",
        "release_year": "1999",
        "director": "Vince Offer",
        "summary": "A series of comedic short films guaranteed to offend.",
        "rating": "2.0"
    },
    {
        "id": "tt0036022",
        "movie_name": "The Human Comedy",
        "release_year": "1943",
        "director": "Clarence Brown",
        "summary": "Teenager Homer Macauley stays at home in small-town Ithaca to support his family while his older brother Marcus prepares to go to war.",
        "rating": "7.0"
    },
    {
        "id": "tt0330069",
        "movie_name": "Blue Collar Comedy Tour: The Movie",
        "release_year": "2003",
        "director": "C.B. Harding",
        "summary": "The comedic stylings of four sort-of famous funnymen are brought to the big screen courtesy of this 2002 documentary.",
        "rating": "7.1"
    },
    {
        "id": "tt34718200",
        "movie_name": "Untitled Musical Comedy Jesse Eisenberg",
        "release_year": "Julianne Moore, Paul Giamatti",
        "director": "Jesse Eisenberg",
        "summary": "A shy woman unexpectedly cast in a local musical production loses herself in the role under the spell of the strong-willed director, immersing herself in the high-stakes world of community theater.",
        "rating": "N/A"
    },
    {
        "id": "tt11891698",
        "movie_name": "Stasikomödie",
        "release_year": "2022",
        "director": "Leander Haußmann",
        "summary": "After falling in love with the Nathalie and sleeping with his first target, Corinna, Ludger ends up living two lives - one as an underground poet and one as a Stasi agent - both of which eventually come back to haunt him 30 years later.",
        "rating": "5.6"
    },
    {
        "id": "tt35002915",
        "movie_name": "Untitled FBI Wedding Sting Comedy",
        "release_year": "Anne Hathaway, Dave Bautista",
        "director": "N/A",
        "summary": "Polar opposite FBI agents are forced to live together undercover. Initially hostile towards each other, they gradually develop mutual respect while closing the case.",
        "rating": "N/A"
    },
    {
        "id": "tt7051624",
        "movie_name": "The Revenger: An Unromantic Comedy",
        "release_year": "2019",
        "director": "Mark Murphy",
        "summary": "A fairy-tale romance takes an unexpected turn when Mark discovers that his beautiful bride-to-be, Connie, has actually been plotting against him.",
        "rating": "5.6"
    },
    {
        "id": "tt0032846",
        "movie_name": "No Time for Comedy",
        "release_year": "1940",
        "director": "William Keighley",
        "summary": "Playwright Gaylord Esterbrook scores a hit with his first Broadway play, both with the critics and with leading lady Linda Paige. He and Linda are happily married until a patroness of the arts convinces Esterbrook to forget about comedy and concentrate on writing a tragedy. The e...Read all",
        "rating": "6.2"
    },
    {
        "id": "tt0463486",
        "movie_name": "L'ivresse du pouvoir",
        "release_year": "2006",
        "director": "Claude Chabrol",
        "summary": "A magistrate investigates a corporate executive.",
        "rating": "6.3"
    },
    {
        "id": "tt2633666",
        "movie_name": "The Dramatics: A Comedy",
        "release_year": "2015",
        "director": "Scott Rodgers",
        "summary": "Romantic comedy about an actress who stars in a sexually explicit mini-series adaptation of a best-selling erotic chick-lit novel, and her loving but tortured stoner boyfriend is forced to deal with it.",
        "rating": "4.6"
    },
    {
        "id": "tt15255958",
        "movie_name": "Comedy Queen",
        "release_year": "2022",
        "director": "Sanna Lenken",
        "summary": "After her mother's death and father's ensuing depression, 13-year-old Sasha decides to look on the bright side of life and become a stand-up comedian.",
        "rating": "6.7"
    },
    {
        "id": "tt0086205",
        "movie_name": "Romantic Comedy",
        "release_year": "1983",
        "director": "Arthur Hiller",
        "summary": "A successful playwright employs a new female writing partner, and it's love on first sight, but it happens to be the day he gets married. They both suppress their feelings for each other in order to form a successful writing partnership.",
        "rating": "5.3"
    },
    {
        "id": "tt1429432",
        "movie_name": "Rio Sex Comedy",
        "release_year": "2010",
        "director": "Jonathan Nossiter",
        "summary": "A group of strangers from different countries end up on Rio's beaches. Seeking self-fulfillment, they look for answers to existential questions. Yet it isn't until their different paths cross that they begin to understand why they came.",
        "rating": "4.7"
    },
    {
        "id": "tt0112710",
        "movie_name": "A Comédia de Deus",
        "release_year": "1995",
        "director": "João César Monteiro",
        "summary": "João de Deus is the manager of an ice-cream shop owned by an ex-prostitute, Paraíso dos Gelados (Ice-Cream Paradise). Through a unmoved desire of perfection, he seeks, through cleansing and purity to attain heaven. The surrounding world, however, does not comply with his decaying...Read all",
        "rating": "7.2"
    },
    {
        "id": "tt20918352",
        "movie_name": "Outstanding: A Comedy Revolution",
        "release_year": "2024",
        "director": "Page Hurwitz",
        "summary": "A feature length documentary that explores the history of LGBTQ+ stand up comedy, considering its importance as an instrument for social change over the past five decades.",
        "rating": "7.4"
    },
    {
        "id": "tt0109440",
        "movie_name": "Fear City: A Family-Style Comedy",
        "release_year": "1994",
        "director": "Alain Berbérian",
        "summary": "A second-class horror movie has to be shown at Cannes Film Festival, but, before each screening, the projectionist is killed by a mysterious fellow, with hammer and sickle, just as it happens in the film to be shown.",
        "rating": "7.5"
    },
    {
        "id": "tt12758600",
        "movie_name": "Comedy Couple",
        "release_year": "2020",
        "director": "Nachiket Samant",
        "summary": "A story about two comedian couples and the up and downs between their parternship.",
        "rating": "7.3"
    },
    {
        "id": "tt9368628",
        "movie_name": "Xin xi ju zhi wang",
        "release_year": "2019",
        "director": "Stephen Chow, Herman Yau",
        "summary": "A young woman who is dreaming and striving to pursue the actors' dream despite being an extra and stand-in.",
        "rating": "6.2"
    },
    {
        "id": "tt14992790",
        "movie_name": "Untitled Sandra Bullock Comedy",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt0387808",
        "movie_name": "Idiocracy",
        "release_year": "2006",
        "director": "Mike Judge",
        "summary": "Corporal Joe Bauers, a decidedly average American, is selected for a top-secret hibernation program but is forgotten and left to awaken to a future so incredibly moronic that he's easily the most intelligent person alive.",
        "rating": "6.5"
    },
    {
        "id": "tt0101739",
        "movie_name": "A Divina Comédia",
        "release_year": "1991",
        "director": "Manoel de Oliveira",
        "summary": "Patients in a mental institution see themselves as Adam and Eve, Sonia and Raskolnikov, a Philosopher and a Prophet, Alyosha and Ivan Karamazov, Jesus, Lazarus, Martha, Mary and St Teresa of Avila.",
        "rating": "7.1"
    },
    {
        "id": "tt0254325",
        "movie_name": "Comédie de l'innocence",
        "release_year": "2000",
        "director": "Raúl Ruiz",
        "summary": "Today, Camille turns nine. He had sworn that on his 9th birthday he would show his parents the videos he was shooting on the side-the tail of a cat scampering away, a window, and a veiled woman's face - an intriguing picture... Later that day, Camille's mother, Ariane, meets up w...Read all",
        "rating": "6.5"
    },
    {
        "id": "tt0056942",
        "movie_name": "The Comedy Man",
        "release_year": "1964",
        "director": "Alvin Rakoff",
        "summary": "Charles Byrd, known as \"Chick\", has spent his adult life acting in small repertory companies all over the UK, and he's never had much luck. All too aware that he's no longer young, Chick makes one last stab at finding success in London.",
        "rating": "6.8"
    },
    {
        "id": "tt1293829",
        "movie_name": "Äntligen midsommar!",
        "release_year": "2009",
        "director": "Ian McCrudden",
        "summary": "A beautiful waterfront house, a Swedish flag fluttering in the wind. A sailboat tied to the wooden deck below. This is the setting of the friends' annual Midsummer celebrations. The friends are gathered at Emil's family house and the herring lunch, sauna, games and compulsory ski...Read all",
        "rating": "4.3"
    },
    {
        "id": "tt11363540",
        "movie_name": "El comediante",
        "release_year": "2021",
        "director": "Rodrigo Guardiola, Gabriel Nuncio",
        "summary": "Gabriel, knocking 40, receives the proposal of having a child with his best friend. With a long history of failures and a city that seems against him, he decides to become a better person and reconcile with life and the cosmos.",
        "rating": "5.1"
    },
    {
        "id": "tt32221196",
        "movie_name": "One of Them Days",
        "release_year": "2025",
        "director": "Lawrence Lamont",
        "summary": "When best friends and roommates Dreux and Alyssa discover Alyssa's boyfriend has blown their rent money, the duo finds themselves going to extremes in a race against the clock to avoid eviction and keep their friendship intact.",
        "rating": "6.5"
    },
    {
        "id": "tt31314504",
        "movie_name": "Romantic Comedy",
        "release_year": NaN,
        "director": "N/A",
        "summary": "After a string of bad relationships, a comedy writer swears off romance until meeting a charming musician who makes her question everything she thought she knew about love.",
        "rating": "N/A"
    },
    {
        "id": "tt36460862",
        "movie_name": "People of Comedy",
        "release_year": "2025",
        "director": "Darrell Faria",
        "summary": "Kenny Robinson's legendary comedy showcase has influenced Canadian comedy for 30 years, with performances by Russell Peters, Hassan Phills, Crystal Ferrier, Mr. Lewin and others.",
        "rating": "6.0"
    },
    {
        "id": "tt9583526",
        "movie_name": "Romantic Comedy",
        "release_year": "2019",
        "director": "Elizabeth Sankey",
        "summary": "Musician and writer Elizabeth Sankey investigates the past, present and future of romantic comedies, assisted by a chorus of critics, actors and filmmakers.",
        "rating": "5.9"
    },
    {
        "id": "tt11261296",
        "movie_name": "Blutsauger",
        "release_year": "2021",
        "director": "Julian Radlmaier",
        "summary": "A penniless Soviet refugee falls in love with an eccentric young vampiress spending the summer at the seaside with her awkward servant. A Marxist vampire comedy.",
        "rating": "5.9"
    },
    {
        "id": "tt3092016",
        "movie_name": "Comedy of Errorz",
        "release_year": "2013",
        "director": "Coke Daniels",
        "summary": "Sick and tired of Hollywood's portrayal of unrealistic urban films, Davon turns to a pimp named Tony to manage his career and help guide him in the right direction which may not be the best idea.",
        "rating": "3.8"
    },
    {
        "id": "tt6224580",
        "movie_name": "Comedy Ensani",
        "release_year": "2017",
        "director": "Mohammad Hadi Karimi",
        "summary": "A comedy of the tragic life of someone who must live like the people around him despite his own preference. The Human Comedy is a comedy narrative of the tragic life of a person who finds himself doing as the Romans do unwillingly.",
        "rating": "4.2"
    },
    {
        "id": "tt2645104",
        "movie_name": "Romantik Komedi 2: Bekarliga Veda",
        "release_year": "2013",
        "director": "Erol Özlevi",
        "summary": "Didem pursues boyfriend Cem for marriage using advice from a book. Her friends Esra and Zeynep are engaged/married. The tactics fail, highlighting Didem's struggles to get Cem to propose despite her efforts following the book's guidance.",
        "rating": "5.1"
    },
    {
        "id": "tt0415306",
        "movie_name": "Talladega Nights: The Ballad of Ricky Bobby",
        "release_year": "2006",
        "director": "Adam McKay",
        "summary": "Number one NASCAR driver Ricky Bobby stays atop the heap thanks to a pact with his best friend and teammate, Cal Naughton, Jr. But when a French Formula One driver, makes his way up the ladder, Ricky Bobby's talent and devotion are put to the test.",
        "rating": "6.6"
    },
    {
        "id": "tt0417547",
        "movie_name": "Comedy Hell",
        "release_year": "2006",
        "director": "Scott LaRose",
        "summary": "3 Stand-up comics cross paths with a religious zealot who's killing Devil worshipers, blasphemers and now... comedians.",
        "rating": "6.0"
    },
    {
        "id": "tt0433116",
        "movie_name": "Looking for Comedy in the Muslim World",
        "release_year": "2005",
        "director": "Albert Brooks",
        "summary": "To improve its relations with Muslim countries, the United States government sends comedian Albert Brooks to south Asia to write a report on what makes followers of Islam laugh.",
        "rating": "5.5"
    },
    {
        "id": "tt11273332",
        "movie_name": "Ban ge xi ju",
        "release_year": "2019",
        "director": "Lu Liu, Shen Zhou",
        "summary": "Three young people have different ideas: one wants to say goodbye to single life, one wants to have a dissipated night before marriage, and one wants to set a firm footing in Beijing. Their frantic life looks almost like a comedy.",
        "rating": "6.7"
    },
    {
        "id": "tt26491533",
        "movie_name": "Untitled Body Swap Comedy/Max Barbakow Project",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt21066260",
        "movie_name": "Untitled Wedding Comedy Project",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt17662096",
        "movie_name": "The Kids in the Hall: Comedy Punks",
        "release_year": "2022",
        "director": "Reg Harkema",
        "summary": "Through never before-seen archive material, interviews with celebrities, industry insiders, rabid fans and the Kids In The Hall themselves.",
        "rating": "8.1"
    },
    {
        "id": "tt0163651",
        "movie_name": "American Pie",
        "release_year": "1999",
        "director": "Paul Weitz",
        "summary": "Four teenage boys enter a pact to lose their virginity by prom night.",
        "rating": "7.0"
    },
    {
        "id": "tt0451021",
        "movie_name": "The Comedians of Comedy",
        "release_year": "2005",
        "director": "Michael Blieden",
        "summary": "Follow four comedians as they tour the States.",
        "rating": "7.2"
    },
    {
        "id": "tt10926156",
        "movie_name": "A Comedy of Horrors, Volume 1",
        "release_year": "2021",
        "director": "N/A",
        "summary": "An anthology of scary stories about clowns, puppets, bridal showers, and voodoo.",
        "rating": "5.8"
    },
    {
        "id": "tt21051906",
        "movie_name": "A Family Affair",
        "release_year": "2024",
        "director": "Richard LaGravenese",
        "summary": "A surprising romance kicks off comic consequences for a young woman, her mother, and her movie-star boss as they face the complications of love, sex, and identity.",
        "rating": "5.4"
    },
    {
        "id": "tt3132632",
        "movie_name": "Misery Loves Comedy",
        "release_year": "2015",
        "director": "Kevin Pollak",
        "summary": "Over fifty very famous American, Canadian, British and Australian funny people (filmmakers, writers, actors and comedians) share life and professional journeys and insights, in an effort to shed light on the thesis: Do you have to be miserable to be funny?",
        "rating": "6.3"
    },
    {
        "id": "tt26384837",
        "movie_name": "A Brush with Comedy",
        "release_year": "2023",
        "director": "Louis Moir",
        "summary": "Five comedians - Vic Reeves, Spencer Jones, Bec Hill, Simon Munnery, and Miriam Elia - create art over three years for a London group exhibition.",
        "rating": "6.9"
    },
    {
        "id": "tt2241597",
        "movie_name": "Taste It: A Comedy About the Recession",
        "release_year": "2012",
        "director": "Zachary Weil",
        "summary": "Scintillating, salacious and, made-in-Miami 'Taste It: A Comedy About the Recession' is an outrageous indie feature about putting passion before the plan and living it up in a down economy.",
        "rating": "5.5"
    },
    {
        "id": "tt0995060",
        "movie_name": "Brutal Massacre: A Comedy",
        "release_year": "2007",
        "director": "Stevan Mena",
        "summary": "David Naughton stars as famed horror director Harry Penderecki whose career has been plagued by violent mishaps and critics' attacks.",
        "rating": "5.7"
    },
    {
        "id": "tt23903368",
        "movie_name": "Mr. Saturday Night: A New Musical Comedy",
        "release_year": "2022",
        "director": "Matthew Diamond, John Rando",
        "summary": "Called \"The funniest show on Broadway in years!\" by Variety, the Tony-Award® nominated Mr. Saturday Night: A New Musical Comedy stars Billy Crystal, Tony-Award® nominee for Best Actor in a Musical, as Buddy Young, Jr., an outrageous and outspoken comedian who has one last shot at...Read all",
        "rating": "7.5"
    },
    {
        "id": "tt0264491",
        "movie_name": "Commedia sexy",
        "release_year": "2001",
        "director": "Claudio Bigagli",
        "summary": "",
        "rating": "4.5"
    },
    {
        "id": "tt1582486",
        "movie_name": "Comedy Express",
        "release_year": "2010",
        "director": "Srinivas Chowdary",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt1306980",
        "movie_name": "50/50",
        "release_year": "2011",
        "director": "Jonathan Levine",
        "summary": "Inspired by a true story, a comedy centered on a 27-year-old guy who learns of his cancer diagnosis and his subsequent struggle to beat the disease.",
        "rating": "7.6"
    },
    {
        "id": "tt5207840",
        "movie_name": "A Comédia Divina",
        "release_year": "2017",
        "director": "Toni Venturi",
        "summary": "The Devil himself comes to Earth to open his own church and the world becomes a pandemonium of delights and confusions. Based on a short story by Machado de Assis, the most famous realistic Brazilian writer of the XIX century.",
        "rating": "4.8"
    },
    {
        "id": "tt0072807",
        "movie_name": "A Comedy in Six Unnatural Acts",
        "release_year": "1979",
        "director": "Jan Oxenberg",
        "summary": "Satirizing a variety of film genres and the ways in which they perpetuate lesbian stereotypes.",
        "rating": "6.6"
    },
    {
        "id": "tt0129119",
        "movie_name": "The Golden Age of Comedy",
        "release_year": "1957",
        "director": "Robert Youngson",
        "summary": "A compilation of scenes featuring some of the best-known comics from the silent era in their best films.",
        "rating": "7.1"
    },
    {
        "id": "tt1913192",
        "movie_name": "Untitled Royal Wedding Comedy",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt1546653",
        "movie_name": "Det røde kapel",
        "release_year": "2009",
        "director": "Mads Brügger",
        "summary": "Two Danish comedians join the director on a trip to North Korea, where they have been allowed access under the pretext of wanting to perform a vaudeville act.",
        "rating": "7.2"
    },
    {
        "id": "tt2834772",
        "movie_name": "Untitled Vince Vaughn/Family Comedy Project",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt0025946",
        "movie_name": "Vesyolye rebyata",
        "release_year": "1934",
        "director": "Grigoriy Aleksandrov",
        "summary": "A musically talented shepherd gets his big chance when he is mistaken for a famous conductor.",
        "rating": "6.9"
    },
    {
        "id": "tt36047903",
        "movie_name": "A Comedy of Errors",
        "release_year": "Siobhan Fallon Hogan, Andy Dick",
        "director": "Mickey Gooch Jr., Noel Leon",
        "summary": "A queer comedian's life spirals into chaos when a pre-Christmas breakup triggers a relapse. Stumbling through NYC with her stoner friend, she seeks help from a bizarre cast of characters, including her sketchy therapist and an ex-con guru.",
        "rating": "N/A"
    },
    {
        "id": "tt0058310",
        "movie_name": "The Big Parade of Comedy",
        "release_year": "1964",
        "director": "Robert Youngson",
        "summary": "A compilation of scenes from classic MGM comedies from the silent era up to 1948's \"A Southern Yankee.\" Among the films showcased are \"The Thin Man, \" \"A Night at the Opera, \" \"Dinner at Eight\" and \"Bonnie Scotland.\"",
        "rating": "5.8"
    },
    {
        "id": "tt0332720",
        "movie_name": "The Original Latin Kings of Comedy",
        "release_year": "2002",
        "director": "Jeb Brien",
        "summary": "In El Paso, Texas, five of the greatest Latino comics come together on one stage in one unforgettable night of uncut and raw comedy.",
        "rating": "6.8"
    },
    {
        "id": "tt36293862",
        "movie_name": "Farrah Abraham: Diary of A Teen Mom Stand Up Comedy Debut",
        "release_year": "2025",
        "director": "Farrah Laurel Abraham",
        "summary": "Farrah Abraham's Diary of a Teen Mom.",
        "rating": "N/A"
    },
    {
        "id": "tt0104983",
        "movie_name": "Nero",
        "release_year": "1992",
        "director": "Giancarlo Soldi",
        "summary": "As a favor to his new girlfriend Francesca Federico visits her ex-lover's apartment and finds him dead. Desperately he tries to cover up the murder and attempts to get rid of the body which involves much more than he bargained for.",
        "rating": "6.1"
    },
    {
        "id": "tt0092773",
        "movie_name": "La comédie du travail",
        "release_year": "1988",
        "director": "Luc Moullet",
        "summary": "From the very beginning, film comedy focused on the world of work. From exploitation to unemployment, from adaptation to resistance, directors multiplied their points of view on survival in the modern world, especially from Chaplin on. With a humor superceding certain conventions...Read all",
        "rating": "6.5"
    },
    {
        "id": "tt33071426",
        "movie_name": "The Drama",
        "release_year": "Robert Pattinson, Zendaya",
        "director": "Kristoffer Borgli",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt1365451",
        "movie_name": "Drama",
        "release_year": "2010",
        "director": "Matias Lira",
        "summary": "Three theater students, influenced by a professor and French theorist Antonin Artaud's acting technique, begin to experiment with their own lives, searching for real emotions and situations to bring onto the stage. Their obsession with becoming better actors leads them to their d...Read all",
        "rating": "4.9"
    },
    {
        "id": "tt35891507",
        "movie_name": "Untitled Hawaii-Set Crime Drama",
        "release_year": "Leonardo DiCaprio, Dwayne Johnson",
        "director": "Martin Scorsese",
        "summary": "In 1970s Hawaii, a local crime boss rises to power while battling to protect his ancestral lands, leading to an epic conflict that transforms the island's underworld and cultural landscape.",
        "rating": "N/A"
    },
    {
        "id": "tt0361467",
        "movie_name": "Confessions of a Teenage Drama Queen",
        "release_year": "2004",
        "director": "Sara Sugarman",
        "summary": "A teenage girl is convinced that her home city revolves around her until her family packs up and moves to the suburbs, where she finds herself competing for attention.",
        "rating": "4.7"
    },
    {
        "id": "tt21337754",
        "movie_name": "A Little Family Drama",
        "release_year": "2024",
        "director": "Nadia Zoe",
        "summary": "A Mexican American family, whose lives revolve around their legendary restaurant, prepares for their annual family reunion dinner oblivious to the fact that a shattered taco truck dream is about to change everything.",
        "rating": "7.2"
    },
    {
        "id": "tt0808237",
        "movie_name": "Drama/Mex",
        "release_year": "2006",
        "director": "Gerardo Naranjo",
        "summary": "Two interlaced stories unfold over the course of the same long, hot day in the once lush and now decadent resort town of Acapulco. The first involves the beautiful and cool Fernanda, who is forced to deal with the sudden emergence of her ex-lover, Chino. Her boyfriend, Gonzalo, m...Read all",
        "rating": "5.9"
    },
    {
        "id": "tt8426964",
        "movie_name": "Drama",
        "release_year": "2018",
        "director": "Ranjith",
        "summary": "Set in UK, Drama follows the hilarious yet enthralling journey of a funeral director, who sets out to fulfill the final wish of one of his clients.",
        "rating": "4.2"
    },
    {
        "id": "tt28349668",
        "movie_name": "Queens of Drama",
        "release_year": "2024",
        "director": "Alexis Langlois",
        "summary": "Pop diva Mimi Madamour's career peaks in 2005 before spiraling downwards due to her tumultuous love affair with punk icon Billie Kohler, their passionate and rage-fueled relationship playing out on stage for half a century.",
        "rating": "6.3"
    },
    {
        "id": "tt3015712",
        "movie_name": "Drama",
        "release_year": "2012",
        "director": "Yograj Bhat",
        "summary": "Two young people, Venkatesh and Nandini, get embroiled in a murder case when the strict principal is killed after he humiliates Nandini.",
        "rating": "6.9"
    },
    {
        "id": "tt3562532",
        "movie_name": "Drama",
        "release_year": "2015",
        "director": "Sophie Mathisen",
        "summary": "Anna travels to Paris following John, unintentionally causing tension between her best friend Jean and his partner Philippe.",
        "rating": "6.2"
    },
    {
        "id": "tt3901006",
        "movie_name": "Drama Drama",
        "release_year": "2019",
        "director": "Martin Guigui",
        "summary": "The most unlikely pairing of teen-age girls end up bonding to form the pop group Drama Drama, and make a stand against bullying in their high school.",
        "rating": "4.6"
    },
    {
        "id": "tt5189772",
        "movie_name": "The Drama Club",
        "release_year": "2017",
        "director": "Joe McClean",
        "summary": "In a twisted maze of ex-lovers, old grudges, and new spouses, friends who haven't seen each other in 20 years fall down a rabbit hole of alcohol-fueled bad decisions.",
        "rating": "6.9"
    },
    {
        "id": "tt36592065",
        "movie_name": "A Deadly American Marriage",
        "release_year": "2025",
        "director": "Jessica Burgess, Jenny Popplewell",
        "summary": "A disturbing 911 call and horrific crime scene raise questions about Jason Corbett's death. His family shares memories and hidden realities beneath their perfect-looking life.",
        "rating": "6.6"
    },
    {
        "id": "tt0014624",
        "movie_name": "A Woman of Paris: A Drama of Fate",
        "release_year": "1923",
        "director": "Charles Chaplin",
        "summary": "A kept woman runs into her former fiancé and finds herself torn between love and comfort.",
        "rating": "6.9"
    },
    {
        "id": "tt10308500",
        "movie_name": "Yu Yu Hakusho: Stage Play",
        "release_year": "2020",
        "director": "Chûji Mikasano",
        "summary": "A delinquent teenager is killed in a car accident, and is resurrected as an investigator of the supernatural.",
        "rating": "7.8"
    },
    {
        "id": "tt15114612",
        "movie_name": "Family Drama",
        "release_year": "2021",
        "director": "Meher Tej",
        "summary": "A dysfunctional family, a serial killer on the loose and when both the worlds meet, it topples many lives .",
        "rating": "7.4"
    },
    {
        "id": "tt0017743",
        "movie_name": "Chang",
        "release_year": "1927",
        "director": "Merian C. Cooper, Ernest B. Schoedsack",
        "summary": "A snapshot of life in the jungles of Northern Siam.",
        "rating": "6.8"
    },
    {
        "id": "tt33322041",
        "movie_name": "Bagger Drama",
        "release_year": "2024",
        "director": "Piet Baumgartner",
        "summary": "The family business demands their full attention: renting, selling and repairing excavators. But when the daughter dies, the family idyll falls apart at the seams. A new Heimatfilm with people searching and machines dancing.",
        "rating": "7.6"
    },
    {
        "id": "tt0825729",
        "movie_name": "Sex Drama",
        "release_year": "2004",
        "director": "Matt Thiesen",
        "summary": "",
        "rating": "6.9"
    },
    {
        "id": "tt12106008",
        "movie_name": "The War of the Worlds: The Musical Drama",
        "release_year": "2018",
        "director": "N/A",
        "summary": "An Audible Original Production in which H.G. Wells' classic, War of the Worlds, is revisited",
        "rating": "7.8"
    },
    {
        "id": "tt1138138",
        "movie_name": "Porno!Melo!Drama!",
        "release_year": "2007",
        "director": "Heesook Sohn",
        "summary": "Over one wild Cologne night, three women in search of the perfect partner and perfect life discover that a little bit of magic changes everything.",
        "rating": "5.4"
    },
    {
        "id": "tt1833845",
        "movie_name": "Eating Out: Drama Camp",
        "release_year": "2011",
        "director": "Q. Allan Brocka",
        "summary": "Temptations at a drama camp threaten a gay relationship that may already be cooling.",
        "rating": "5.3"
    },
    {
        "id": "tt31547884",
        "movie_name": "Love Unlike in K-Dramas",
        "release_year": "2024",
        "director": "Meira Anastasia",
        "summary": "Dhea receives a special gift from her boyfriend, Bimo, in the form of a trip to Seoul, South Korea, with her friends. There, she accidentally meets her long-lost first love. Who will Dhea choose? Will this be a real love triangle drama?",
        "rating": "6.5"
    },
    {
        "id": "tt11651262",
        "movie_name": "Sac Dep Doi Tra",
        "release_year": "2020",
        "director": "Kay Nguyen",
        "summary": "An Action-Comedy about a gay stuntman whose wish of becoming a woman got accidentally fulfilled when he has to run away from a deadly gang after witnessing a murder. After the operation, she could have lived a low-key life if her father had not gotten so sick, and the only opport...Read all",
        "rating": "5.9"
    },
    {
        "id": "tt33084962",
        "movie_name": "Drama 1882",
        "release_year": "2024",
        "director": "Wael Shawky",
        "summary": "Staging a colonial conflict, this libretto across 8 chapters questions colonialism, collaboration, resistance, narratives, and history through treason and exploitation over 44 hypnotic minutes.",
        "rating": "9.1"
    },
    {
        "id": "tt1252385",
        "movie_name": "Drama Kings",
        "release_year": "2009",
        "director": "Dane Anderson, Bryan C. Watkins",
        "summary": "After years of auditioning without booking a thing, four wannabe actors all set their sights on the role of Halitosis in the Roman war epic \"Forgotten Trojans\" in this hip, hilarious, humiliating view of Hollywood from the bottom up.",
        "rating": "8.8"
    },
    {
        "id": "tt0075925",
        "movie_name": "The Deep",
        "release_year": "1977",
        "director": "Peter Yates",
        "summary": "In Bermuda, two amateur treasure-hunting divers have a run-in with local criminals when they inadvertently discover the secret cargo of a World War II shipwreck.",
        "rating": "6.2"
    },
    {
        "id": "tt18271650",
        "movie_name": "Drama Kings",
        "release_year": "Charlie Petersson, Magnus Af Sandeberg",
        "director": "Adi Omanovic, Mak Omanovic",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt0079077",
        "movie_name": "Un Dramma Borghese",
        "release_year": "1979",
        "director": "Florestano Vancini",
        "summary": "Maria visits her paralyzed widower father Guido at a hotel. She tries seducing him. Her friend Therese arrives, and Guido starts an affair with her, leading to tragic consequences. Objective plot points without opinions or introduction.",
        "rating": "5.2"
    },
    {
        "id": "tt0028809",
        "movie_name": "Le drame de Shanghaï",
        "release_year": "1938",
        "director": "Georg Wilhelm Pabst",
        "summary": "A Russian emigrant sings in a Shanghai nightclub under the assumed name of Kay Murphy. All she dreams of is a peaceful life with her daughter Vera. But this is only a pipe dream as she has been forced by her former lover Ivan to work for a secret criminal organization, \"The Black...Read all",
        "rating": "6.4"
    },
    {
        "id": "tt0162536",
        "movie_name": "The Photo-Drama of Creation",
        "release_year": "1914",
        "director": "Charles Taze Russell",
        "summary": "The Photo-Drama of Creation, is a four-part Christian film produced by the Watch Tower Bible and Tract Society of Pennsylvania. The film presents the Bible's account of God's plan from the creation of the earth through to the end of the 1,000 year reign of Christ.",
        "rating": "6.9"
    },
    {
        "id": "tt1241316",
        "movie_name": "Dare",
        "release_year": "2009",
        "director": "Adam Salky",
        "summary": "A drama centered around three high school seniors - an aspiring actress, her misfit best friend, and a loner - who become engaged in an intimate and complicated relationship.",
        "rating": "5.8"
    },
    {
        "id": "tt18829312",
        "movie_name": "Bonbibi - Widows of the Wild",
        "release_year": "2024",
        "director": "Rajdeep Ghosh",
        "summary": "On the Sundarban Bali Island, over 500 people have been killed in attacks by tigers and crocodiles over the past 15 years. The widows of those men are called \"Baagh-vidhvas\" and have been allocated an entire portion of village separate for them. Intricacies of the lives of the Ti...Read all",
        "rating": "7.9"
    },
    {
        "id": "tt32832440",
        "movie_name": "Family Drama",
        "release_year": "2024",
        "director": "Akarsh",
        "summary": "Dysfunctional family torn apart by selfishness and misguided schemes, each member pursuing their own agenda with disastrous consequences.",
        "rating": "6.0"
    },
    {
        "id": "tt11580628",
        "movie_name": "Drama Girl",
        "release_year": "2020",
        "director": "Vincent Boy Kars",
        "summary": "An experimental blend of documentary and fiction which challenges a young woman to cope with a number of key episodes from her recent past by reenacting them.",
        "rating": "6.4"
    },
    {
        "id": "tt0044557",
        "movie_name": "Don't Bother to Knock",
        "release_year": "1952",
        "director": "Roy Ward Baker",
        "summary": "After being dumped by his girlfriend, an airline pilot pursues a babysitter in his hotel and gradually realizes that she is dangerous.",
        "rating": "6.9"
    },
    {
        "id": "tt6957816",
        "movie_name": "Bloody Drama",
        "release_year": "2017",
        "director": "Colin Bressler",
        "summary": "Bloody drama follows the story of a pool party involving five former college sororiety sisters attempting one last weekend blowout. While trying hard to grab onto their fun youth filled past they are faced with what is their troubled divisive present. As they water down their iss...Read all",
        "rating": "2.4"
    },
    {
        "id": "tt8010330",
        "movie_name": "Drama Queen",
        "release_year": NaN,
        "director": "John Mervin",
        "summary": "A wanna-be actor deceives everyone in order to act alongside his favorite actress.",
        "rating": "N/A"
    },
    {
        "id": "tt27531007",
        "movie_name": "Love Drama",
        "release_year": "2023",
        "director": "Liang Yin",
        "summary": "Director Liang Yin has a skill: he can make strangers fall in love or break up within a few minutes.",
        "rating": "N/A"
    },
    {
        "id": "tt0037272",
        "movie_name": "Shibaidô",
        "release_year": "1944",
        "director": "Mikio Naruse",
        "summary": "",
        "rating": "6.2"
    },
    {
        "id": "tt9024814",
        "movie_name": "Drama Meets Vengeance",
        "release_year": "2019",
        "director": "Sally Mueller",
        "summary": "It's been a tough couple of years for Ethan Miller; after college he couldn't get out of his frat boy ways and ends up losing his girlfriend, wrecking his car and going no where in his \"music career.\" One day two years later when visiting the DMV after yet again another car wreck...Read all",
        "rating": "7.8"
    },
    {
        "id": "tt7397550",
        "movie_name": "Drama na okhote",
        "release_year": "1918",
        "director": "Cheslav Sabinsky",
        "summary": "An adaptation of novel \"The Shooting Party\" by Anton Chekhov.",
        "rating": "N/A"
    },
    {
        "id": "tt12424356",
        "movie_name": "Mama Drama",
        "release_year": "2020",
        "director": "Seyi Babatope",
        "summary": "",
        "rating": "5.6"
    },
    {
        "id": "tt4061358",
        "movie_name": "A King's Drama",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt3397754",
        "movie_name": "10,000 Saints",
        "release_year": "2015",
        "director": "Shari Springer Berman, Robert Pulcini",
        "summary": "Set in the 1980s, a teenager from Vermont moves to New York City to live with his father in East Village.",
        "rating": "5.9"
    },
    {
        "id": "tt10050608",
        "movie_name": "Drama",
        "release_year": "2019",
        "director": "Nikita Lavretski, Yulia Shatun, Alexey Svirsky",
        "summary": "",
        "rating": "6.2"
    },
    {
        "id": "tt5646936",
        "movie_name": "Drama Sue",
        "release_year": "Esther Guigui, Jonathan Green",
        "director": "Martin Guigui",
        "summary": "An entertaining insightful look at the \"elementary school musical\", as Veteran drama teacher Sue Robinson puts on \"Grease\".",
        "rating": "N/A"
    },
    {
        "id": "tt0038493",
        "movie_name": "Un drama nuevo",
        "release_year": "1946",
        "director": "Juan de Orduña",
        "summary": "London, 1605. William Shakespeare is about to launch a new drama in The Globe. The comic actor Yorick urges the author to grant him the lead role, although he is not very gifted for serious roles. Then it begins a curious correspondence between what happens on stage and what happ...Read all",
        "rating": "6.8"
    },
    {
        "id": "tt28082985",
        "movie_name": "Period Romantic Drama",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt28980246",
        "movie_name": "Not the Drama We Expected",
        "release_year": "2022",
        "director": "Kate Rodriguez",
        "summary": "Amidst relationship drama, prom prep, and a tight race for Prom King and Queen, the GFP High School Drama and Digital Media students are ready to risk it all to save their clubs.",
        "rating": "N/A"
    },
    {
        "id": "tt0065662",
        "movie_name": "Dramma della gelosia (tutti i particolari in cronaca)",
        "release_year": "1970",
        "director": "Ettore Scola",
        "summary": "A three-way love affair in the Rome of the early seventies.",
        "rating": "7.1"
    },
    {
        "id": "tt1486190",
        "movie_name": "Tamara Drewe",
        "release_year": "2010",
        "director": "Stephen Frears",
        "summary": "A young newspaper writer returns to her hometown in the English countryside, where her childhood home is being prepped for sale.",
        "rating": "6.2"
    },
    {
        "id": "tt0301224",
        "movie_name": "Drama in blond",
        "release_year": "1984",
        "director": "Lothar Lambert",
        "summary": "A mousey, mild-mannered, mid-thirties bank clerk visits a cabaret and discovers his taste for drag and for the club's techie.",
        "rating": "N/A"
    },
    {
        "id": "tt0050091",
        "movie_name": "Seven Waves Away",
        "release_year": "1957",
        "director": "Richard Sale",
        "summary": "A ship's officer finds himself in command of a lifeboat full of survivors of a sunken luxury liner.",
        "rating": "7.5"
    },
    {
        "id": "tt0052773",
        "movie_name": "Nor the Moon by Night",
        "release_year": "1958",
        "director": "Ken Annakin",
        "summary": "Brothers compete for a woman's affection while danger lurks at every turn in an African wild game park.",
        "rating": "5.8"
    },
    {
        "id": "tt22311484",
        "movie_name": "Drama Single Shot",
        "release_year": "2022",
        "director": "Aju Kizhumala",
        "summary": "",
        "rating": "7.0"
    },
    {
        "id": "tt31947652",
        "movie_name": "Drama Queen",
        "release_year": "2024",
        "director": "Cassidy Bot-Devire",
        "summary": "The once inseparable Bella and Sophie go head to head to prove their place at the top of the social hierarchy in this \"Mean Girls\" meets \"Heathers\" dark comedy.",
        "rating": "N/A"
    },
    {
        "id": "tt0032671",
        "movie_name": "Kitty Foyle",
        "release_year": "1940",
        "director": "Sam Wood",
        "summary": "A hard-working white-collar girl from a middle-class family meets and falls in love with a young socialite, but she soon clashes with his family.",
        "rating": "6.9"
    },
    {
        "id": "tt0051565",
        "movie_name": "Dunkirk",
        "release_year": "1958",
        "director": "Leslie Norman",
        "summary": "A dramatization of the British Expeditionary Force's 1940 retreat to the beaches of France and the extraordinary seaborne evacuation that saved it from utter destruction by Nazi Germany.",
        "rating": "7.1"
    },
    {
        "id": "tt0282783",
        "movie_name": "Nearest and Dearest",
        "release_year": "1972",
        "director": "John Robins",
        "summary": "Two estranged middle-aged siblings are forced back together when they inherit a pickle factory which they struggle to keep afloat due to a lack of funds and little business acumen, as they both vie for control.",
        "rating": "5.3"
    },
    {
        "id": "tt10534030",
        "movie_name": "Dramarama",
        "release_year": "2020",
        "director": "Jonathan Wysocki",
        "summary": "In 1994, a closeted teen struggles to part ways with his 4 high school drama friends at their final slumber party before they leave for college.",
        "rating": "6.4"
    },
    {
        "id": "tt30327537",
        "movie_name": "Narodna Drama",
        "release_year": "2016",
        "director": "Bojana Lazic",
        "summary": "About a strange love triangle - or about two people who are in love and a third person who is in their way. \"The Folk Play\" by Olga Dimitrijevic is adapted by Bojana Lazic, and Slobodan Obradovic.",
        "rating": "N/A"
    },
    {
        "id": "tt21262316",
        "movie_name": "Under 18 drama movie",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt36816992",
        "movie_name": "Drama Queen",
        "release_year": "Jahangir Khan, Arbaaz Khan",
        "director": "Saleem Murad",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt1249441",
        "movie_name": "Hoochie Mamma Drama",
        "release_year": "2008",
        "director": "Alfredo Rates",
        "summary": "A Los Angeles Mexican hood comedy about a drug dealing Lothario juggling women and navigating drug deals.",
        "rating": "5.1"
    },
    {
        "id": "tt28317932",
        "movie_name": "All the Weekend's Drama",
        "release_year": "2024",
        "director": "John Robb Saunders",
        "summary": "A wayward, yet gentle hearted twenty year-old grows up in the face of her underprivileged life in Los Angeles.",
        "rating": "9.0"
    },
    {
        "id": "tt7546550",
        "movie_name": "The Drama Club Part 1",
        "release_year": "2018",
        "director": "Denise J Smith",
        "summary": "Set in the year 2015; A unique group of high school seniors spend a semester together in after school detention. They will each find themselves tethered to one another in ways they wouldn't expect while dealing with the many social issues in their worlds around them.",
        "rating": "6.6"
    },
    {
        "id": "tt0157044",
        "movie_name": "Sitcom",
        "release_year": "1998",
        "director": "François Ozon",
        "summary": "The adventures of an upper-class suburban family dealing with their younger brother's homosexuality, elder sister's suicide attempt, masochist tendencies, and a free-spirited maid and her husband.",
        "rating": "6.6"
    },
    {
        "id": "tt7465914",
        "movie_name": "Sex Madness: Classic Drama",
        "release_year": "2016",
        "director": "N/A",
        "summary": "Called by some a sexploitation film, this has become a cult classic. Paul fights publically against the spread of what he calls social disease. Burlesque shows, casual sex and worse! We see all of this through the eyes of the various characters in the film. Even lesbians are brou...Read all",
        "rating": "8.6"
    },
    {
        "id": "tt5665116",
        "movie_name": "Drama Class",
        "release_year": "2016",
        "director": "Caleb Francis Jenkins, Emerson Niemchick",
        "summary": "A high school drama class bands together to save their school from a Japanese gang.",
        "rating": "6.7"
    },
    {
        "id": "tt0122464",
        "movie_name": "Drama på slottet",
        "release_year": "1943",
        "director": "Bodil Ipsen",
        "summary": "The aging King Christian the 5th reigns from Copenhagen Castle and the gloom is heavy. When the young, lively junker Frederich arrives there is change is the air.",
        "rating": "6.0"
    },
    {
        "id": "tt23142536",
        "movie_name": "PHD (Pyar Hai Drama)",
        "release_year": "2023",
        "director": "Amritpreet Singh",
        "summary": "Follows three married couples who have established in the UK as they query what love is. Their relationships, which were once a bed of roses, have now reached a place where they are struggling to maintain them. Can love triumph?",
        "rating": "6.6"
    },
    {
        "id": "tt0065152",
        "movie_name": "Une femme douce",
        "release_year": "1969",
        "director": "Robert Bresson",
        "summary": "A young woman kills herself, leaving no explanation to her grief-stricken pawnbroker husband. We learn in flashback about how they met, married, and how she failed to adapt her lifestyle to his. Disgusted with his attempts to dominate her, she considered murdering him, but found ...Read all",
        "rating": "7.3"
    },
    {
        "id": "tt0060126",
        "movie_name": "Around the World Under the Sea",
        "release_year": "1966",
        "director": "Andrew Marton",
        "summary": "The crew of a five-man submarine travels the world oceans, planting sensors on the ocean floor to warn scientists of any impending earthquakes.",
        "rating": "5.3"
    }
]