[
    {
        "id": "tt0078732",
        "movie_name": "Action",
        "release_year": "1980",
        "director": "Tinto Brass",
        "summary": "Bruno is an idealistic hero who questions the meaning of life in this confusing and sometimes hallucinatory erotic drama. After a night in jail, he is gang-raped by punk rockers in a garbage dump. He later saves an old man who believes he is Garibaldi and a woman he believes is O...Read all",
        "rating": "4.4"
    },
    {
        "id": "tt0094612",
        "movie_name": "Action Jericho",
        "release_year": "1988",
        "director": "Craig R. Baxley",
        "summary": "Vengeance drives a tough Detroit cop to stay on the trail of a power-hungry auto magnate who is systematically eliminating his competition.",
        "rating": "5.6"
    },
    {
        "id": "tt6495770",
        "movie_name": "Action Point",
        "release_year": "2018",
        "director": "Tim Kirkby",
        "summary": "A daredevil designs and operates his own theme park with his friends.",
        "rating": "5.1"
    },
    {
        "id": "tt0107362",
        "movie_name": "Last Action Hero",
        "release_year": "1993",
        "director": "John McTiernan",
        "summary": "With the help of a magic ticket, a young movie fan is transported into the fictional world of his favorite action movie character.",
        "rating": "6.5"
    },
    {
        "id": "tt21191806",
        "movie_name": "Back in Action",
        "release_year": "2025",
        "director": "Seth Gordon",
        "summary": "Former CIA spies Emily and Matt are pulled back into espionage after their secret identities are exposed.",
        "rating": "5.9"
    },
    {
        "id": "tt15263752",
        "movie_name": "Action! Action!",
        "release_year": "2025",
        "director": "Adam Kilbourn, Danny Shepherd",
        "summary": "A crew attempts to steal Al Capone's painting from Vegas' Mob Museum. After a double-cross leaves teammates dead and the painting destroyed, they race to uncover who betrayed them.",
        "rating": "9.4"
    },
    {
        "id": "tt1396208",
        "movie_name": "Action Replayy",
        "release_year": "2010",
        "director": "Vipul Amrutlal Shah",
        "summary": "A young man tries to revive his parents' wilting marriage by traveling to the 1970s when their romance was budding and make it bloom: something more complex than he expects.",
        "rating": "4.4"
    }
]