[
    {
        "id": "tt0078732",
        "movie_name": "Action",
        "release_year": "1980",
        "director": "Tinto Brass",
        "summary": "Bruno is an idealistic hero who questions the meaning of life in this confusing and sometimes hallucinatory erotic drama. After a night in jail, he is gang-raped by punk rockers in a garbage dump. He later saves an old man who believes he is Garibaldi and a woman he believes is O...Read all",
        "rating": "4.4"
    },
    {
        "id": "tt6495770",
        "movie_name": "Action Point",
        "release_year": "2018",
        "director": "Tim Kirkby",
        "summary": "A daredevil designs and operates his own theme park with his friends.",
        "rating": "5.1"
    },
    {
        "id": "tt0094612",
        "movie_name": "Action Jericho",
        "release_year": "1988",
        "director": "Craig R. Baxley",
        "summary": "Vengeance drives a tough Detroit cop to stay on the trail of a power-hungry auto magnate who is systematically eliminating his competition.",
        "rating": "5.6"
    },
    {
        "id": "tt21191806",
        "movie_name": "Back in Action",
        "release_year": "2025",
        "director": "Seth Gordon",
        "summary": "Former CIA spies Emily and Matt are pulled back into espionage after their secret identities are exposed.",
        "rating": "5.9"
    },
    {
        "id": "tt0107362",
        "movie_name": "Last Action Hero",
        "release_year": "1993",
        "director": "John McTiernan",
        "summary": "With the help of a magic ticket, a young movie fan is transported into the fictional world of his favorite action movie character.",
        "rating": "6.5"
    },
    {
        "id": "tt15263752",
        "movie_name": "Action! Action!",
        "release_year": "2025",
        "director": "Adam Kilbourn, Danny Shepherd",
        "summary": "A crew attempts to steal Al Capone's painting from Vegas' Mob Museum. After a double-cross leaves teammates dead and the painting destroyed, they race to uncover who betrayed them.",
        "rating": "9.4"
    },
    {
        "id": "tt0087727",
        "movie_name": "Missing in Action",
        "release_year": "1984",
        "director": "Joseph Zito",
        "summary": "Colonel Braddock launches a mission deep into the jungles of Vietnam to find the POW camp that he escaped from and free the Americans still held captive there.",
        "rating": "5.4"
    },
    {
        "id": "tt1396208",
        "movie_name": "Action Replayy",
        "release_year": "2010",
        "director": "Vipul Amrutlal Shah",
        "summary": "A young man tries to revive his parents' wilting marriage by traveling to the 1970s when their romance was budding and make it bloom: something more complex than he expects.",
        "rating": "4.4"
    },
    {
        "id": "tt10955578",
        "movie_name": "Action",
        "release_year": "2019",
        "director": "Sundar C.",
        "summary": "An agent, sent by the Indian army to observe a terrorist, finds his mission complicated when he discovers undercover agents in his own country.",
        "rating": "4.7"
    },
    {
        "id": "tt0120633",
        "movie_name": "A Civil Action",
        "release_year": "1998",
        "director": "Steven Zaillian",
        "summary": "At the risk of bankrupting his firm and career, lawyer Jan Schlichtman takes on a case involving two companies responsible for causing children to be diagnosed with leukemia due to the town's contaminated water supply.",
        "rating": "6.6"
    },
    {
        "id": "tt0318155",
        "movie_name": "Looney Tunes: Back in Action",
        "release_year": "2003",
        "director": "Joe Dante",
        "summary": "Bugs Bunny and Daffy Duck team up with an aspiring stuntman and a studio executive in order to rescue the stuntman's missing father and locate a mythical diamond before the head of a major conglomerate uses it for his own wicked deeds.",
        "rating": "5.8"
    },
    {
        "id": "tt0035608",
        "movie_name": "Action in the North Atlantic",
        "release_year": "1943",
        "director": "Lloyd Bacon, Byron Haskin, Raoul Walsh",
        "summary": "An American tanker is sunk by a German U-boat, and the survivors spend 11 days at sea on a raft. Their next assignment - bound for Murmansk through the sub-stalked N. Atlantic.",
        "rating": "7.0"
    },
    {
        "id": "tt15600222",
        "movie_name": "An Action Hero",
        "release_year": "2022",
        "director": "Anirudh Iyer",
        "summary": "A murder accusation turns a movie star's own life into an eccentric action thriller as he flees the country, with a vengeful politician hot on his heels.",
        "rating": "7.0"
    },
    {
        "id": "tt11015214",
        "movie_name": "Class Action Park",
        "release_year": "2020",
        "director": "Seth Porges, Chris Charles Scott III",
        "summary": "A documentary that focuses on a dangerously legendary water park and its slew of injuries and crimes along with child safety concerns.",
        "rating": "7.0"
    },
    {
        "id": "tt0101590",
        "movie_name": "Class Action",
        "release_year": "1991",
        "director": "Michael Apted",
        "summary": "An attorney representing a traumatized accident victim finds that his opponent is a very familiar defense attorney - his own daughter.",
        "rating": "6.4"
    },
    {
        "id": "tt15237908",
        "movie_name": "Action Force",
        "release_year": "Joe Anoa'i, Pierson Fode",
        "director": "N/A",
        "summary": "",
        "rating": "N/A"
    },
    {
        "id": "tt12703292",
        "movie_name": "A Man of Action",
        "release_year": "2022",
        "director": "Javier Ruiz Caldera",
        "summary": "In this drama inspired by the life of Lucio Urtubia, an anarchist targets one of the world's biggest banks with an ingenious counterfeiting operations.",
        "rating": "6.4"
    },
    {
        "id": "tt0403935",
        "movie_name": "Action Jackson",
        "release_year": "2014",
        "director": "Prabhu Deva",
        "summary": "In order to escape crime and clutches of a ruthless mafia, a Bangkok based hit man seeks the help of his lookalike, a Mumbai based goon.",
        "rating": "3.4"
    },
    {
        "id": "tt5320514",
        "movie_name": "Action Hero Biju",
        "release_year": "2016",
        "director": "Abrid Shine",
        "summary": "The life of an honest and determined police officer Biju and the various criminals he puts behind bars.",
        "rating": "7.6"
    },
    {
        "id": "tt0106215",
        "movie_name": "Acción mutante",
        "release_year": "1993",
        "director": "Álex de la Iglesia",
        "summary": "In a future ruled by attractive people, mutant terrorists kidnap a rich man's daughter to claim rights for the ugly. Escaping police, the mutant leader crashes into a planet of crazy miners where no women live.",
        "rating": "6.4"
    },
    {
        "id": "tt0089604",
        "movie_name": "Missing in Action 2: The Beginning",
        "release_year": "1985",
        "director": "Lance Hool",
        "summary": "Prequel to the first Missing In Action, set in the early 1980s it shows the capture of Colonel Braddock during the Vietnam war in the 1970s, and his captivity with other American POWs in a brutal prison camp, and his plans to escape.",
        "rating": "5.3"
    },
    {
        "id": "tt8678318",
        "movie_name": "Gundam I: The Live-Action Movie",
        "release_year": "Leon Masuda, Alexander Raye Pimentel",
        "director": "Jim Mickle, Jordan Vogt-Roberts",
        "summary": "After an attack on his space colony high above the planet Earth, Amuro Ray climbs in his father's prototype mobile suit, a Gundam--to protect the populace from Zeon invaders. Strict adaptation of the animated movie \"Mobile Suit Gundam I.\"",
        "rating": "N/A"
    },
    {
        "id": "tt13186482",
        "movie_name": "Mufasa: The Lion King",
        "release_year": "2024",
        "director": "Barry Jenkins",
        "summary": "Mufasa, a cub lost and alone, meets a sympathetic lion named Taka, the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of a group of misfits searching for their destiny.",
        "rating": "6.6"
    },
    {
        "id": "tt0070046",
        "movie_name": "Executive Action",
        "release_year": "1973",
        "director": "David Miller",
        "summary": "Rogue intelligence agents, right-wing politicians, greedy capitalists, and free-lance assassins plot and carry out the JFK assassination.",
        "rating": "6.7"
    },
    {
        "id": "tt0096757",
        "movie_name": "Action U.S.A.",
        "release_year": "1989",
        "director": "John Stewart",
        "summary": "After her boyfriend is murdered by the gangsters whose diamonds he stole, a girl is protected by two FBI agents who plan to keep her from sharing the same fate.",
        "rating": "6.0"
    },
    {
        "id": "tt0109195",
        "movie_name": "Back in Action",
        "release_year": "1994",
        "director": "Steve DiMarco, Paul Ziller",
        "summary": "Former U.S. Green Beret's sister dates a mobster, endangering her life. Her brother fights to save her from her boyfriend and his friends, with or without help from tough cop Rossi.",
        "rating": "5.4"
    },
    {
        "id": "tt5195538",
        "movie_name": "Untitled Hong Kong Action Thriller",
        "release_year": NaN,
        "director": "N/A",
        "summary": "N/A",
        "rating": "N/A"
    },
    {
        "id": "tt0076543",
        "movie_name": "A Piece of the Action",
        "release_year": "1977",
        "director": "Sidney Poitier",
        "summary": "A retired Chicago cop blackmails two rich thieves into \"volunteering\" to help juvenile delinquents change paths.",
        "rating": "6.4"
    },
    {
        "id": "tt2298239",
        "movie_name": "Action #1",
        "release_year": "Mike Castle, Jimmy Tatro",
        "director": "Alex Fernie",
        "summary": "A comic book store-owner assembles five smart and equally geeky associates to pull off the heist of a lifetime- stealing the most valuable comic from Nicholas Cage and holding it for ransom.",
        "rating": "N/A"
    },
    {
        "id": "tt0094792",
        "movie_name": "Braddock: Missing in Action III",
        "release_year": "1988",
        "director": "Aaron Norris",
        "summary": "Braddock mounts a one-man assault to free his wife and son who are still being held in a Vietnam prison camp.",
        "rating": "4.9"
    },
    {
        "id": "tt7656570",
        "movie_name": "Legal Action",
        "release_year": "2018",
        "director": "Brent Christy",
        "summary": "A woman asks her big shot lawyer ex-husband to defend her career criminal brother, accused of killing a DA. He'll need more than his legal skills to stay alive and win the case.",
        "rating": "5.9"
    },
    {
        "id": "tt0075083",
        "movie_name": "La polizia accusa: il servizio segreto uccide",
        "release_year": "1975",
        "director": "Sergio Martino",
        "summary": "Starting the investigation of a murder mystery, a police man is to investigate dangerously top politicians and military. A chain of suicides takes its toll among the current and past leaders of Italy in a particularly difficult season for the Italian Democracy.",
        "rating": "6.4"
    },
    {
        "id": "tt0050099",
        "movie_name": "Action of the Tiger",
        "release_year": "1957",
        "director": "Terence Young",
        "summary": "Carson is an American contraband runner approached by Tracy, a French woman who wants him to help rescue her brother from Albania where he is being held as a political prisoner.",
        "rating": "5.1"
    },
    {
        "id": "tt0357413",
        "movie_name": "Anchorman: The Legend of Ron Burgundy",
        "release_year": "2004",
        "director": "Adam McKay",
        "summary": "In the 1970s, an anchorman's stint as San Diego's top-rated newsreader is challenged when an ambitious newswoman becomes his co-anchor.",
        "rating": "7.1"
    },
    {
        "id": "tt5805470",
        "movie_name": "Gintama",
        "release_year": "2017",
        "director": "Yûichi Fukuda",
        "summary": "In an era where aliens have invaded and conquered feudal Tokyo, a young samurai seeks work as he can.",
        "rating": "6.1"
    },
    {
        "id": "tt1448754",
        "movie_name": "Thanksgiving",
        "release_year": "2023",
        "director": "Eli Roth",
        "summary": "After a Black Friday riot ends in tragedy, a mysterious Thanksgiving-inspired killer terrorizes Plymouth, Massachusetts, the birthplace of the infamous holiday.",
        "rating": "6.2"
    },
    {
        "id": "tt31598972",
        "movie_name": "Maa Kaali",
        "release_year": "2024",
        "director": "Vijay Yelakanti",
        "summary": "The tragic events of August 16, 1946 - one of the darkest chapters in the history of Bengal. The communal violence that erupted on that day that deeply affected the lives of countless people of the region.",
        "rating": "N/A"
    },
    {
        "id": "tt2370244",
        "movie_name": "Action",
        "release_year": "2013",
        "director": "Anil Sunkara",
        "summary": "Bava (Allari Naresh), Ajay (Kick Shyam), Shiva (Vaibhav) and Purush (Raju Sundaram) are thick friends. They grow up together and share everything in life. While Bava is an easy going person, Ajay and Shiva are seen as more mature and responsible people. Purush is a comical flirt....Read all",
        "rating": "3.4"
    },
    {
        "id": "tt0368688",
        "movie_name": "Direct Action",
        "release_year": "2004",
        "director": "Sidney J. Furie",
        "summary": "Frank Gannon, a veteran cop, is being hunted by his fellow police officers after they learned he has betrayed the brotherhood and exposed to the feds wide scale corruption of the LAPD. He has one day left to prove his case and survive.",
        "rating": "5.0"
    },
    {
        "id": "tt0176948",
        "movie_name": "Love and Action in Chicago",
        "release_year": "1999",
        "director": "Dwayne Johnson-Cochran",
        "summary": "Eddie Jones (Courtney B. Vance) is an agent with the U.S. State Department's elite Eliminator Corps. He eliminates people the government doesn't want around. Eddie also needs to change his life.",
        "rating": "4.9"
    },
    {
        "id": "tt6772950",
        "movie_name": "Truth or Dare",
        "release_year": "2018",
        "director": "Jeff Wadlow",
        "summary": "A harmless game of Truth or Dare among friends turns deadly when someone - or something - begins to punish those who tell a lie or refuse the dare.",
        "rating": "5.2"
    },
    {
        "id": "tt17677492",
        "movie_name": "The Violence Action",
        "release_year": "2022",
        "director": "Tôichirô Rutô",
        "summary": "A young girl leads a double life as an assassin for hire.",
        "rating": "4.8"
    },
    {
        "id": "tt34621929",
        "movie_name": "Untitled Zach Snyder LAPD Action Movie",
        "release_year": NaN,
        "director": "Zack Snyder",
        "summary": "An elite LAPD unit confronts the clash between law and morality in high-stakes life-and-death situations, exploring the intense and complex landscape of law enforcement.",
        "rating": "N/A"
    },
    {
        "id": "tt0061000",
        "movie_name": "Le Soleil Des Voyous",
        "release_year": "1967",
        "director": "Jean Delannoy",
        "summary": "Sophisticated crook talks ex-crook and now respectable business man into one last caper. This highly planned and well executed crime goes off without a hitch until rival bad guys want a piece of the action.",
        "rating": "6.4"
    },
    {
        "id": "tt10323676",
        "movie_name": "The Contractor",
        "release_year": "2022",
        "director": "Tarik Saleh",
        "summary": "A discharged U.S. Army Special Operations Forces sergeant, James Harper, risks everything for his family when he joins a private contracting organization.",
        "rating": "5.8"
    },
    {
        "id": "tt0167145",
        "movie_name": "Evasive Action",
        "release_year": "1998",
        "director": "Jerry P. Jacobs",
        "summary": "Five prisoners on train to prison. Brakes fail, train speeds to LA. One prisoner uncouples cars to save passengers, others hunt him to stop escape.",
        "rating": "4.6"
    },
    {
        "id": "tt0337887",
        "movie_name": "Sledge: The Untold Story",
        "release_year": "2005",
        "director": "Brad Martin",
        "summary": "In the spring of 1986, no one had heard of Frank Sledge. One year later, Bloodfight 2 was #1 at the box office... And a star was born.",
        "rating": "3.8"
    },
    {
        "id": "tt26673530",
        "movie_name": "The Action Pack",
        "release_year": "2023",
        "director": "Vali Dobrogeanu",
        "summary": "A traffic officer who likes playing detective starts investigating a case, uncovering dangers beyond what he thought was a simple bookie robbery.",
        "rating": "4.9"
    },
    {
        "id": "tt7117870",
        "movie_name": "Love Action Drama",
        "release_year": "2019",
        "director": "Dhyan Sreenivasan",
        "summary": "A man goes through all kinds of action to impress the girl he is in love with a hope to marry her.",
        "rating": "5.2"
    },
    {
        "id": "tt13423846",
        "movie_name": "321 Action",
        "release_year": "2020",
        "director": "Shady Al Ramly",
        "summary": "A solitary actress devoted to caring for her daughter decides to return to acting with a new movie; many comedic ironies occur during the filming of this new film.",
        "rating": "1.0"
    },
    {
        "id": "tt0085794",
        "movie_name": "The King of Comedy",
        "release_year": "1982",
        "director": "Martin Scorsese",
        "summary": "Rupert is an aspiring stand-up comedian, who is willing to go the extra mile in his attempt to appear in the late night show hosted by his idol.",
        "rating": "7.8"
    },
    {
        "id": "tt0304678",
        "movie_name": "Sex Is Comedy",
        "release_year": "2002",
        "director": "Catherine Breillat",
        "summary": "A director struggles to film a difficult, intimate sex scene between two actors who happen to hate each other.",
        "rating": "5.7"
    },
    {
        "id": "tt1754811",
        "movie_name": "InAPPropriate Comedy",
        "release_year": "2013",
        "director": "Vince Offer",
        "summary": "In this comedy film, a computer tablet full of the world's most hilariously offensive apps breaks through the borders of political correctness, stirring up cultural anarchy.",
        "rating": "2.7"
    },
    {
        "id": "tt0188766",
        "movie_name": "King of Comedy",
        "release_year": "1999",
        "director": "Stephen Chow, Lik-Chi Lee",
        "summary": "A bar girl hires a struggling actor to give her acting lessons so that she can feign a greater interest in her customers. The longer they work together, the more they find they have in common.",
        "rating": "7.2"
    },
    {
        "id": "tt2112293",
        "movie_name": "The Comedy",
        "release_year": "2012",
        "director": "Rick Alverson",
        "summary": "Indifferent to the notion of inheriting his father's estate, a restless, aging New Yorker passes time with his friends in games of mock sincerity and irreverence.",
        "rating": "6.3"
    },
    {
        "id": "tt0056943",
        "movie_name": "The Comedy of Terrors",
        "release_year": "1963",
        "director": "Jacques Tourneur",
        "summary": "Dishonest undertaker Waldo Trumbull and his sidekick Felix Gillie are creating their own customers when they cannot find willing ones.",
        "rating": "6.5"
    },
    {
        "id": "tt0084329",
        "movie_name": "A Midsummer Night's Sex Comedy",
        "release_year": "1982",
        "director": "Woody Allen",
        "summary": "In the early 20th century, wacky inventor Andrew Hobbs and his wife Adrian invite two other couples for a weekend party at their romantic summer house in the countryside in this paean to Ingmar Bergman's Smiles of a Summer Night.",
        "rating": "6.6"
    },
    {
        "id": "tt0222850",
        "movie_name": "The Broken Hearts Club: A Romantic Comedy",
        "release_year": "2000",
        "director": "Greg Berlanti",
        "summary": "An insight into the turbulent lives and loves of a gay clique based in Los Angeles.",
        "rating": "6.9"
    },
    {
        "id": "tt0236388",
        "movie_name": "The Original Kings of Comedy",
        "release_year": "2000",
        "director": "Spike Lee",
        "summary": "A concert film featuring four major African American stand up comedians.",
        "rating": "6.8"
    },
    {
        "id": "tt0201290",
        "movie_name": "The Underground Comedy Movie",
        "release_year": "1999",
        "director": "Vince Offer",
        "summary": "A series of comedic short films guaranteed to offend.",
        "rating": "2.0"
    },
    {
        "id": "tt0036022",
        "movie_name": "The Human Comedy",
        "release_year": "1943",
        "director": "Clarence Brown",
        "summary": "Teenager Homer Macauley stays at home in small-town Ithaca to support his family while his older brother Marcus prepares to go to war.",
        "rating": "7.0"
    },
    {
        "id": "tt34718200",
        "movie_name": "Untitled Musical Comedy Jesse Eisenberg",
        "release_year": "Julianne Moore, Paul Giamatti",
        "director": "Jesse Eisenberg",
        "summary": "A shy woman unexpectedly cast in a local musical production loses herself in the role under the spell of the strong-willed director, immersing herself in the high-stakes world of community theater.",
        "rating": "N/A"
    },
    {
        "id": "tt11891698",
        "movie_name": "Stasikomödie",
        "release_year": "2022",
        "director": "Leander Haußmann",
        "summary": "After falling in love with the Nathalie and sleeping with his first target, Corinna, Ludger ends up living two lives - one as an underground poet and one as a Stasi agent - both of which eventually come back to haunt him 30 years later.",
        "rating": "5.6"
    },
    {
        "id": "tt0330069",
        "movie_name": "Blue Collar Comedy Tour: The Movie",
        "release_year": "2003",
        "director": "C.B. Harding",
        "summary": "The comedic stylings of four sort-of famous funnymen are brought to the big screen courtesy of this 2002 documentary.",
        "rating": "7.1"
    },
    {
        "id": "tt35002915",
        "movie_name": "Untitled FBI Wedding Sting Comedy",
        "release_year": "Anne Hathaway, Dave Bautista",
        "director": "N/A",
        "summary": "Polar opposite FBI agents are forced to live together undercover. Initially hostile towards each other, they gradually develop mutual respect while closing the case.",
        "rating": "N/A"
    },
    {
        "id": "tt7051624",
        "movie_name": "The Revenger: An Unromantic Comedy",
        "release_year": "2019",
        "director": "Mark Murphy",
        "summary": "A fairy-tale romance takes an unexpected turn when Mark discovers that his beautiful bride-to-be, Connie, has actually been plotting against him.",
        "rating": "5.6"
    },
    {
        "id": "tt0032846",
        "movie_name": "No Time for Comedy",
        "release_year": "1940",
        "director": "William Keighley",
        "summary": "Playwright Gaylord Esterbrook scores a hit with his first Broadway play, both with the critics and with leading lady Linda Paige. He and Linda are happily married until a patroness of the arts convinces Esterbrook to forget about comedy and concentrate on writing a tragedy. The e...Read all",
        "rating": "6.2"
    },
    {
        "id": "tt0463486",
        "movie_name": "L'ivresse du pouvoir",
        "release_year": "2006",
        "director": "Claude Chabrol",
        "summary": "A magistrate investigates a corporate executive.",
        "rating": "6.3"
    },
    {
        "id": "tt15255958",
        "movie_name": "Comedy Queen",
        "release_year": "2022",
        "director": "Sanna Lenken",
        "summary": "After her mother's death and father's ensuing depression, 13-year-old Sasha decides to look on the bright side of life and become a stand-up comedian.",
        "rating": "6.7"
    },
    {
        "id": "tt2633666",
        "movie_name": "The Dramatics: A Comedy",
        "release_year": "2015",
        "director": "Scott Rodgers",
        "summary": "Romantic comedy about an actress who stars in a sexually explicit mini-series adaptation of a best-selling erotic chick-lit novel, and her loving but tortured stoner boyfriend is forced to deal with it.",
        "rating": "4.6"
    },
    {
        "id": "tt1429432",
        "movie_name": "Rio Sex Comedy",
        "release_year": "2010",
        "director": "Jonathan Nossiter",
        "summary": "A group of strangers from different countries end up on Rio's beaches. Seeking self-fulfillment, they look for answers to existential questions. Yet it isn't until their different paths cross that they begin to understand why they came.",
        "rating": "4.7"
    },
    {
        "id": "tt20918352",
        "movie_name": "Outstanding: A Comedy Revolution",
        "release_year": "2024",
        "director": "Page Hurwitz",
        "summary": "A feature length documentary that explores the history of LGBTQ+ stand up comedy, considering its importance as an instrument for social change over the past five decades.",
        "rating": "7.4"
    },
    {
        "id": "tt0086205",
        "movie_name": "Romantic Comedy",
        "release_year": "1983",
        "director": "Arthur Hiller",
        "summary": "A successful playwright employs a new female writing partner, and it's love on first sight, but it happens to be the day he gets married. They both suppress their feelings for each other in order to form a successful writing partnership.",
        "rating": "5.3"
    },
    {
        "id": "tt0109440",
        "movie_name": "Fear City: A Family-Style Comedy",
        "release_year": "1994",
        "director": "Alain Berbérian",
        "summary": "A second-class horror movie has to be shown at Cannes Film Festival, but, before each screening, the projectionist is killed by a mysterious fellow, with hammer and sickle, just as it happens in the film to be shown.",
        "rating": "7.5"
    },
    {
        "id": "tt0112710",
        "movie_name": "A Comédia de Deus",
        "release_year": "1995",
        "director": "João César Monteiro",
        "summary": "João de Deus is the manager of an ice-cream shop owned by an ex-prostitute, Paraíso dos Gelados (Ice-Cream Paradise). Through a unmoved desire of perfection, he seeks, through cleansing and purity to attain heaven. The surrounding world, however, does not comply with his decaying...Read all",
        "rating": "7.2"
    }
]